[
  {
    "id": "film-376",
    "title_tc": "世外",
    "synopsis_tc": "人死後，輪迴之前，亡魂會來到「世外」，由靈守帶領投胎轉世。直至一天，靈守小鬼遇上了被執念詛咒的小妹，若小妹完全被忿恨支配，不論世外還是人間都會與她一同灰飛煙滅！為阻止悲劇發生，小鬼不惜踏上了橫跨千年的宏大征途，為的只是一個承諾⋯⋯睽違 22 年再有港產動畫揚威海外，新生代動畫導演吳啓忠、監製兼編劇楊寶文聯同本地製作團隊，耗時七年將得獎短片重新製作，糅合佛教哲學與東方美學，在充滿憤怒及絕望的世界中，引領我們面對仇恨與遺憾，嘗試放下並繼續前行。",
    "runtime_minutes": 111,
    "director": "吳啓忠",
    "country": "香港",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/376?page=1",
    "category_id": "category-67",
    "title_en": "Another World",
    "synopsis_en": "In this visually stunning animated fantasy, death is just the beginning. Between life and rebirth lies \"Another World\", where the spirit guide Gudo shepherds lost souls to their reincarnation. When he encounters Yuri, a young girl whose uncontrollable rage threatens both the physical and spiritual realms, Gudo faces his greatest challenge yet. Tasked by Goddess Mira to prevent Yuri’s curse from destroying the world, Gudo embarks on a perilous mission – a thousand-year journey. Marking a triumphant return of Hong Kong animation to the global stage, Ng’s adaptation of the Japanese novel Sennenki is a mesmerising exploration of grief, anger, and redemption.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/376?page=1"
  },
  {
    "id": "film-377",
    "title_tc": "神秘場",
    "synopsis_tc": "港產片世界首映﹗",
    "runtime_minutes": 90,
    "director": "",
    "country": "",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/377?page=1",
    "category_id": "category-67",
    "title_en": "Surprise Screening",
    "synopsis_en": "World Premiere of a Hong Kong Film!",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/377?page=1"
  },
  {
    "id": "film-378",
    "title_tc": "逆轉上半場",
    "synopsis_tc": "人生勝利組希文靠自己努力，打敗 99.9% 香港人，卻因誤信朋友面臨破產邊緣。由深水灣搬到深水埗，勢要在短時間內極速債務重組，一日未認輸一日都未輸！得知天真富二代正籌組足球聯賽，剛好同房表妹閒時會在街場與幾個小嘍囉踢波追夢，有乜比基層追夢更追夢。當然一波會有三折，到底希文與五個小孩又會如何踢出精彩的一局呢？典型格局非典型救贖，久違的温情港產喜劇，笑聲笑聲滿載温馨，注入我體內，大小演員個個賣力演出，演活擅打逆境波的港人故事。",
    "runtime_minutes": 104,
    "director": "黃柏基",
    "country": "香港",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/378?page=1",
    "category_id": "category-67",
    "title_en": "Pass and Goal",
    "synopsis_en": "Once a high-flying financial advisor, Hay Man loses everything and moves from her Deep Water Bay mansion to her cousin's modest home in \"Deep Water Bo\". Hoping to restore her fortune, she agrees to coach a scrappy U12 football team led by her cousin Ying and neighbourhood children for a league organised by a clueless rich heir. What begins as reluctant duty soon transforms into true mentorship, as Hay Man helps the kids confront struggles and regains her own sense of purpose. When the underdog team reaches the finals, she must choose between luxury past and newfound identity.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/378?page=1"
  },
  {
    "id": "film-379",
    "title_tc": "殺手#4",
    "synopsis_tc": "車仔麵舖主打代客斬料，原來暗藏殺機？亞洲神秘殺手組織以麵店為幌子，隱藏鬧市之中為殺手接單及交換情報。4 號自幼失去雙親,在麵店長大並成為職業殺手，一次獲派到日本公幹暗殺黑幫頭目，竟然失手被當地少女埋伏！原來對方正是本次任務委託人，為求復仇不惜傾家蕩產，試圖拉攏 4 號幫忙完成報仇大計，卻令兩人雙雙被黑幫追殺⋯⋯新晉導演梁居英自編自導，當紅男星魏浚笙首度擔綱出演男主角，聯同日本新星南沙良、巨星竹中直人，以及朱栢謙和韋羅莎等人從香港打到日本，順勢打入美國奇幻電影節競賽。",
    "runtime_minutes": 108,
    "director": "梁居英",
    "country": "香港、日本",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/379?page=1",
    "category_id": "category-67",
    "title_en": "Road to Vendetta",
    "synopsis_en": "Hidden in a bustling city, a noodle shop serves as a hub for a mysterious assassin organisation. No.4, orphaned and raised in the shop, accepts a seemingly straightforward mission in Japan, where he falls into a trap set by his mysterious client. As she attempts to recruit him for her vendetta, their actions lead to both being hunted by the yakuza. Starring rising star Jeffrey Ngai in his first leading role, alongside Japanese newcomer Sara Minami and veteran Naoto Takenaka, with Chu Pak Him and Rosa Maria Velasco, this Hong Kong-Japan coproduction delivers a composed and enthralling calling card from a cast who together make an unstoppable team.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/379?page=1"
  },
  {
    "id": "film-380",
    "title_tc": "電競女孩",
    "synopsis_tc": "「我們接下來可以做什麼？」職業電競隊隊長因多支隊伍被解散，決意轉換跑道成為職場新人，看似重踏「正軌」其實過得同條鹹魚冇分別，自閉打機時機緣巧合認識了隱世世一，重燃電競初心。嘗試不靠後台，瞞住老豆男友自組隊伍參加業餘比賽。更在茶餐廳自組民間比賽聲名大噪，卻招來財團惡意打壓，面對再次的 Cancel、解散，夢想如戰場，這班在虛擬世界的戰友又如何在現實生活中打敗巨人？首部劇情電影計劃大專組作品，楊帆與白瑋琪戲裏戲外一齊用愛發電，合導交出一齣青春熱血電競物語，一時輸贏並不那麼重要，唯有並肩作戰才能繼續開發新的秩序。",
    "runtime_minutes": 110,
    "director": "白瑋琪、楊帆",
    "country": "香港",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/380?page=1",
    "category_id": "category-67",
    "title_en": "Gamer Girls",
    "synopsis_en": "When her professional esports team disbands, former captain Summer ventures into the corporate world after graduation. Unable to shake her passion for competitive gaming, she forms \"Gamer Girls\", an amateur all-female team that transforms local Cha Chaan Teng into gaming venues. Just as they gain popularity, gaming companies shut down their events citing copyright violations. With Hong Kong esports team selections looming, these determined players must fight to restore their competition rights. Co-directors Veronica Bassetto and Sophie Yang deliver an energetic youth esports tale, where winning or losing matters less than fighting side by side to forge an ideal world.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/380?page=1"
  },
  {
    "id": "film-381",
    "title_tc": "像我這樣的愛情",
    "synopsis_tc": "我們這樣，是愛嗎？阿妹天生患有腦性麻痺，性格卻異常跳脫樂觀，閒時會約朋友踩板吹水，畫畫作樂，二十多年來一直努力不被身體耽誤。可是過度保護的母親堅決安排她進行子宮切除手術，阿妹努力建立的生活再次失去平衡，她的身體永遠是不由自主的。在朋友推薦下，阿妹找到了一個專為殘疾人士提供性服務的自發組織，並認識了義工 Ken。這無私的相遇彷彿撫慰了兩個受傷的靈魂，那日漸累積的情愫沖淡了道德與身體的羈絆，這樣的關係，是愛嗎？譚惠貞繼《以青春的名義》(第 14 屆開幕電影)後第二部長片作品，將愛情元素和身障者性權益議題融合，成就一個道德探索與自我尋找的故事。",
    "runtime_minutes": 105,
    "director": "譚惠貞",
    "country": "香港",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/381?page=1",
    "category_id": "category-67",
    "title_en": "Someone Like Me",
    "synopsis_en": "Mui, a vibrant young lady with cerebral palsy, has always navigated life optimistically despite its challenges. However, her carefully constructed world is threatened when her overprotective mother insists on a hysterectomy, causing Mui to fear the loss of her identity as a woman. Seeking solace and autonomy, she discovers a unique volunteer group providing sexual services for disabled individuals. There, she meets Ken, an enigmatic volunteer grappling with his own hidden wounds. Their connection deepens, blossoming into an affectionate yet elusive bond that challenges societal norms and physical limitations. Like Tam's In Your Dreams (14th HKAFF Opening Film), Someone Like Me is a provocative exploration of desire, identity, and the courage to claim one's own narrative.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/381?page=1"
  },
  {
    "id": "film-382",
    "title_tc": "今天應該很高興",
    "synopsis_tc": "在加拿大安大略省一個日漸沒落的華人社區，四名九十年代移居而至的港人，看似平淡的移民生活正悄然崩塌。過氣香港樂壇新星、中年照顧者女兒、艱辛求存的單親母親、喪偶多年自詡模範移民的中佬，同譜一幅有關離散與脆弱連結的心靈群像。四個脆弱靈魂渴望相連，但原來寂寞可以無邊蔓延。導演成長於加國移民社區，影像聚焦九十年代移民的掙扎與孤獨，回不去也難融入。借鏡前人經歷，面對當代的移民潮，或許這也是你和我的自我拷問——我們每個人,何以為家?",
    "runtime_minutes": 110,
    "director": "楊永光",
    "country": "香港、加拿大",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/382?page=1",
    "category_id": "category-67",
    "title_en": "Finch & Midland",
    "synopsis_en": "In the often overlooked, aging neighbourhoods of Scarborough, Ontario, four Hong Kong immigrants who arrived in the 1990s quietly unravel in middle age. Once a rising star in Hong Kong, a devoted carer for her elderly mother, a single mother struggling to make ends meet, and a widower yearning for connection – they each clutch fading fragments of dignity, community, and hope in a place as worn and forgotten as they are. The film portrays these fragile souls reaching out for connection – and discovering how far loneliness can stretch. Growing up within this immigrant community, the director witnessed firsthand the resilience of immigrants, creating a poignant meditation on displacement, aging, and the delicate threads that bind us all.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/382?page=1"
  },
  {
    "id": "film-383",
    "title_tc": "國寶",
    "synopsis_tc": "立花喜久雄生於黑道之家，在衝突中喪父後，因獨有天分而獲歌舞伎名門花井半二郎破格收入門下，與花井家繼承人俊介亦敵亦友，互相砥礪，將青春奉獻給舞台。喜久雄為衝破偏見躋身頂流，甘願與魔鬼交易；俊介身為名門之後，純正血脈是祝福還是詛咒？血統與才能、榮耀與孤寂、信任與背叛，交織出一襲以藝術為名的華美之袍,上面卻爬滿蝨子。在劇變時代中、無形枷鎖下，要花多少代價，方可成就舉世無雙的「國寶」？李相日第三度將吉田修一著作搬上大銀幕，獲譽為「震撼靈魂的狂熱」，日本狂收 140 億，躍升日本真人電影史上票房第二位，代表日本角逐奧斯卡。",
    "runtime_minutes": 174,
    "director": "李相日",
    "country": "日本",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/383?page=1",
    "category_id": "category-67",
    "title_en": "Kokuho",
    "synopsis_en": "Set against the sumptuous world of Kabuki, Japan's stylised male theatrical tradition, Kokuho opens in Nagasaki in 1964 and unfolds the intertwined destinies of two devoted performers. After the death of his yakuza father, gifted teenager Kikuo catches the eye of renowned Kabuki master Hanjiro Hanai, who breaks tradition to accept him as a disciple. Alongside Hanai's only son and heir Shunsuke, Kikuo embarks on a five-decade journey where artistic pursuits mirror the intense drama of their personal lives, filled with triumph, desire, and devastating loss. Lee Sang-il's adaptation of Shuichi Yoshida's bestseller became Japan's second-highest-grossing live-action film with over 14 billion yen at the box office, acclaimed as a \"once-in-a-century masterpiece\".",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/383?page=1"
  },
  {
    "id": "film-409",
    "title_tc": "愛情悄悄來了",
    "synopsis_tc": "36個鏡頭，記下幕幕已成追憶的感情段落。她慣用數碼相機，他偏愛菲林質感；她為電影勘景，他作美術布置。電腦突然報銷，女生失去了所有和他的照片，在忘了與忘不了之間，她只能努力地尋找失落的影像，試圖重回和他共度的時光。納華普先以短片導演及編劇身分活躍於泰國獨立影壇，首部長片以36 個定格鏡頭進行視覺實驗，構圖簡約獨特，含蓄凝視之中埋藏情感暗湧，影像富有詩意地呈現記憶之虛無與人生感情散聚無常。",
    "runtime_minutes": 68,
    "director": "納華普譚容格坦拿列",
    "country": "泰國",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/409?page=1",
    "category_id": "category-67",
    "title_en": "36",
    "synopsis_en": "A poetic experiment with 36 static shots, mirroring analog film frames, crafts a meditation on memory and loss. When location scout Sai's hard drive crashes, erasing a year's photos including traces of a potential romance, she embarks on a quest to recover her digital memories. Between forgetting and remembering lies a constant yearning for memory fragments and an ambiguous longing for love. Nawapol first built his presence in the Thai independent film scene through short films and screenwriting. His first feature gained him wider recognition as a notable directorial voice.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/409?page=1"
  },
  {
    "id": "film-397",
    "title_tc": "好孩子",
    "synopsis_tc": "變裝皇后家好與家人疏離，因媽媽罹患失智症需貼身照顧，才久違回了家。母親記憶力衰退，不斷提起家好童年軼事，耿耿於懷。有次家好忘記卸妝被母親撞見,為安撫她，只好謊稱自己是母親失散多年的女兒，怎料母親信以為真，令家好展開一段療癒原生家庭創傷之旅。到底家好是否可以月圓？王國燊繼《男兒王》又一變裝皇后力作，聯同新加坡視帝許瑞祺和《花路阿朱媽》(第 19 屆)洪慧芳，將新加坡變裝皇后 Sammi Zhen 真實故事搬上大銀幕。",
    "runtime_minutes": 105,
    "director": "王國燊",
    "country": "新加坡",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/397?page=1",
    "category_id": "category-67",
    "title_en": "A Good Child",
    "synopsis_en": "While researching his drag-themed comedy Number 1, director Ong Kuo Sin met Singaporean drag performer Christopher Lim (a.k.a. Sammi Zhen), whose real-life story became the basis for the compelling comedy-drama A Good Child. Rising star Richie Koh stars as Jia Hao, a sassy drag queen who returns home to his ailing mother Ju Hua (Golden Horse-nominated Hong Hui Fang of Ajooma) when she's diagnosed with dementia. One day, when Ju Hua is confused at seeing Jia Hao in drag, he introduces himself as Ju Hua's long-lost daughter, starting a deception that proves humorous, heartbreaking and even healing to the estranged mother and son.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/397?page=1"
  },
  {
    "id": "film-402",
    "title_tc": "良心風暴",
    "synopsis_tc": "《八月照相館》韓國名導許秦豪最新力作，一洗細膩感性作風，改編荷蘭暢銷小說《The Dinner》，黑色晚餐引爆兩兄弟尖銳矛盾。冷靜精明的律師大佬 vs 理想主義醫生細佬，一場原本優雅的晚餐猝然變調。奢華餐桌美學也難掩上流家族偽善深淵，骨肉同謀映照階級與人性悲歌。當下一代驟生變故，要守護良知還是守護孩子？薛景求、張東健兩大影帝同場鬥戲、劇力萬鈞，金喜愛展現犀利氣場，聯手將一頓晚餐演繹成一場關於親情、權力與道德的審判。",
    "runtime_minutes": 110,
    "director": "許秦豪",
    "country": "南韓",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/402?page=1",
    "category_id": "category-67",
    "title_en": "A Normal Family",
    "synopsis_en": "Successful but morally dubious defense lawyer Jae-wan and principled pediatrician Jae-gyu are brothers who pretend to get along when they meet monthly for dinner. But when they learn that their teenage kids are involved in a violent crime, brotherly civility gives way to moral clashes over how to handle the incident. Despite being best known for quiet dramas Christmas in August and One Fine Spring Day, director Hur Jin-ho gives his suspenseful adaptation of Dutch novel The Dinner the breathless momentum of a speeding train until it reaches an inevitable and tragic conclusion.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/402?page=1"
  },
  {
    "id": "film-401",
    "title_tc": "群山淡影",
    "synopsis_tc": "1982 年，英國。一位年輕有抱負的日英混血作家準備書寫其母親——1952 年，英國。戰後移英的日本婦人悅子，因長女自殺而憶起在長崎的最後一段時光。悅子與婦人幸子相遇，幸子也準備和女兒出國，對新生活翹首以待。然而，作家在拼湊線索及母親的記憶碎片時，漸漸發現母親的記憶與現實相左......石川慶改編諾貝爾文學獎得主石黑一雄早年同名原著，雙線刻劃戰後女性掙扎求存之境，表面平靜實質波瀾不休，折射出大時代下壓抑而沉重的集體記憶與痛苦。",
    "runtime_minutes": 123,
    "director": "石川慶",
    "country": "日本、英國、波蘭",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/401?page=1",
    "category_id": "category-67",
    "title_en": "A Pale View of Hills",
    "synopsis_en": "Set in 1982 UK, director Kei Ishikawa's adaptation of Nobel Prize-winning author Kazuo Ishiguro's debut novel follows a young aspiring Japanese-British writer who plans to write a book based on her mother Etsuko's post-war experiences in Nagasaki. Haunted by the suicide of her older daughter, Etsuko begins to recount her memories from 1952 as a young mother-to-be. Her story starts with her encounter with Sachiko, a young woman full of hope about starting a new life abroad with her young daughter. The writer finds troubling inconsistencies as she pieces together the mementoes of her mother's Nagasaki years with the memories Etsuko shares.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/401?page=1"
  },
  {
    "id": "film-387",
    "title_tc": "關於我老婆轉世成為吸塵機那件事",
    "synopsis_tc": "不想被忘記，日夜陪住你。工廠女工因空氣污染去世，卻附身在一部吸塵機守護丈夫，對決一班不甘工傷而死、大肆鬧事的鬼魂。死人再培訓，做個有用鬼，靈幻黑色幽默折射出泰國當代社會變化。死亡並不可怕，可怕在社會忘記那些應該被好好記住的前人。糅合短片前作《間諜之聲》的酷兒視角，並找來《戀愛病發》人氣女星任女主角，帶來悲喜交織、視覺風格強烈的驚人首作，以瘋狂包裝政治寓言，在康城影展影評人周大放異彩。",
    "runtime_minutes": 130,
    "director": "Ratchapoom Boonbunchachoke",
    "country": "泰國、法國、新加坡、德國",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/387?page=2",
    "category_id": "category-67",
    "title_en": "A Useful Ghost",
    "synopsis_en": "A woman's spirit possesses a vacuum cleaner to stay with her loving husband. To prove her ghostly worth to her snooty in-laws, she helps weed out other unwanted ghosts. Upending expectations with a surreal mix of transcendent romance, deadpan dark humour and satirical suspense with environmental, political and queer themes, Ratchapoom Boonbunchachoke’s eccentric debut feature became the first Thai film to win the Grand Prix at Cannes Critics’ Week. What starts like a fantastical horror-comedy reveals itself to be a haunting exploration of loss, remembrance and defiance in a world where the powerless are treated like dust – but it's not so easy to get rid of dust.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/387?page=2"
  },
  {
    "id": "film-433",
    "title_tc": "震後餘生",
    "synopsis_tc": "1995 年，未名在阪神大地震之後突然離開丈夫小村，小村機緣巧合下到了北海道，聽到一段有關 UFO 的傳聞。2011 年，離家出走的順子在海邊跟愛收集漂流木的三宅聊天，三宅望着燃燒的漂流木，道出 16 年前的過去。2020 年,善也因一通電話憶起九年前大地震過後，信徒母親告知他是神之子。2025 年，剛退休的片桐遇上青蛙君，人形巨蛙稱 30 年前曾與他一同作戰阻止東京地震，請他再次拯救東京。導演井上剛與《Drive My Car》編劇大江崇允聯手改編村上春樹短篇小說集《神的孩子都在跳舞》。災難之後餘震未止，被過去的陰霾與未來的不定籠罩我們該如何自處?",
    "runtime_minutes": 133,
    "director": "井上剛",
    "country": "日本",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/433?page=2",
    "category_id": "category-67",
    "title_en": "After the Quake",
    "synopsis_en": "Adapted by the former writer and producer of Drive My Car, Haruki Murakami's After the Quake – originally written in response to the 1995 Great Hanshin Earthquake – draws on four stories from the collection to depict the lingering psychological impact of disastrous events on Japanese society over three decades. In 1995, a salaryman struggles to understand why his wife left him after the earthquake. In 2011, two drifters share past trauma around a bonfire. In 2020, a man recalls his youth spent in a religious group with his mother. In 2025, a security guard encounters a frog that needs his help to stop an earthquake.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/433?page=2"
  },
  {
    "id": "film-403",
    "title_tc": "被消失的家園",
    "synopsis_tc": "上世紀八十年代，西岸群眾起義，示威頻仍。巴勒斯坦少年加入隊伍，前方是以軍嚴陣戒備，氣氛劍拔弩張。走上街頭豈是數分鐘內的決定？年邁母親道來始末，應是每步都受家族歷史的脈搏牽絆。雅法果園香遠益清，祖父一家枝繁葉茂，直至戰事四散天涯；父親愛詩而柔和，烽煙時代卻容不下恬靜的心；兒子果敢,誓要作出反撲。父親橫於兩代之間，最是難忘遷徙與根源——雅法到底是誰的雅法？居無定所，居無定心，惟有家在人在。",
    "runtime_minutes": 146,
    "director": "Cherien Dabis",
    "country": "德國、塞蒲路斯",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/403?page=2",
    "category_id": "category-67",
    "title_en": "All That's Left of You",
    "synopsis_en": "Cherien Dabis's epic saga of a Palestinian family in the Occupied West Bank begins in 1988, when a teenager takes to the streets to protest the occupation. But to understand what led to that life-changing moment, the film journeys back to 1948, where it follows the boy's mother, Hanan, as she witnesses her father's expulsion from Jaffa. Spanning multiple decades, Dabis's tender and heartbreaking masterpiece depicts the tragedy of forced displacement and the scars it leaves on the generations that follow. More importantly, it shines a light on the deep-rooted conflict that continues to dominate headlines today.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/403?page=2"
  },
  {
    "id": "film-446",
    "title_tc": "從來",
    "synopsis_tc": "湖南偏遠山區，孩童詩句與如畫影像交織。導演偶然在網上讀到農村孩子的詩作，被純粹而真摯的字句打動，因而帶着鏡頭走進詩中世界，跟隨小孩在山野中遊戲，在學校裏學寫詩，留下告別童年前的印記。陳德明出身靜態攝影，是次摒棄傳統紀錄片敘事，以電影語言作詩，將日常事物各種狀態轉化為流動影像，讓感受流瀉心田之間。土地與生活中的人和事，從來只要用心凝視,，能感受到自由流動的詩意。本片憑藉獨特美學氣質脫穎而出，橫掃影展多個獎項。",
    "runtime_minutes": 88,
    "director": "陳德明",
    "country": "美國、法國、中國",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/446?page=2",
    "category_id": "category-67",
    "title_en": "Always",
    "synopsis_en": "Chen Deming establishes himself as one of the most exciting new voices in documentary filmmaking with this gorgeously-rendered portrait of a young poet. In the mountains of Hunan Province, eight-year-old Youbin discovers the magic of Chinese poetry when taught the subject in school. Shot over three years, Chen's slice-of-life documentary traces how Youbin's difficult life influences his art and how his life changes through his formative years. Rendering Youbin's rural surroundings with stunningly beautiful frames, Chen hasn't just captured the life of an unlikely poet with his mesmerising debut feature, he's created cinematic poetry himself.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/446?page=2"
  },
  {
    "id": "film-421",
    "title_tc": "藝術學院1994",
    "synopsis_tc": "九十年代南方藝術學院，一群志向遠大的年輕人佇立於思潮巨變之中，不斷探索自己在藝術世界的定位。大學作為成長交叉口，即將分道揚鑣的眾人對藝術、友情、愛情及前程各有看法。導演劉健率中國美術學院師生團隊，延續其獨特手繪風格，集結鼎盛配音陣容包括畢贛、蔡康永、賈樟柯、五條人主音仁科等，以一段段帶着迷惘和希冀又毫不避俗的對話拋出大哉問——哲學及藝術的意義何在？在什麼都能稱上藝術的年代,又如何找到藝術的真諦？",
    "runtime_minutes": 118,
    "director": "劉健",
    "country": "中國",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/421?page=2",
    "category_id": "category-67",
    "title_en": "Art College 1994",
    "synopsis_en": "Have a Nice Day director Liu Jian is known for his artisan animation style tuning into generational malaise with textured, hand-drawn aesthetics and deadpan realism. His third feature returns to the start of his creative journey: art school. Based on the director's own experiences, the coming-of-age film captures a meandering moment in time for a circle of art school cohorts engrossed in arts, ideals and themselves while being lost in life and love. Among the talkers, dreamers and drifters is aimless painting student Xiaojun, whose struggle between traditional and modern art mirrors the changing urban values of Chinese society at large in the 90s.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/421?page=2"
  },
  {
    "id": "film-393",
    "title_tc": "翠湖",
    "synopsis_tc": "喪偶之後,昆明翠湖的水面上，只見老翁孤單身影。伴侶離世成為他回顧往昔的契機——年少青梅，原以為能相伴到老，但因大女兒強烈反對而無法重聚；三個女兒早已各自組建家庭，天倫之樂看似近在眼前，卻總是難以成全；摯友們相繼長辭，更不斷提醒着他餘下時光有限......新晉導演卞灼首部長片聚焦老人生命晚期的處境，從平靜日常呈現細微張力，寫實描繪當代中國家庭三代，以及人際之間難以化解的矛盾與距離。",
    "runtime_minutes": 120,
    "director": "卞灼",
    "country": "中國",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/393?page=2",
    "category_id": "category-67",
    "title_en": "As the Water Flows",
    "synopsis_en": "The debut feature from cinematographer Bian Zhuo won Best Film in the Asian New Talent Competition at the Shanghai International Film Festival. Bian also served as screenwriter, editor and director of photography for this elegiac drama about Xie Shuwen, an elderly widower who considers a new romance one year after the passing of his wife. However, his decision is fraught, sowing discontent among his grown children, complicating a web of family matters, and bringing to light past hardships. Facing emotional difficulties and uncooperative health, Xie strives to heal his family and himself before life's light fades.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/393?page=2"
  },
  {
    "id": "film-389",
    "title_tc": "柬做小戲鬼",
    "synopsis_tc": "舊戲院將被拆卸,守護此地的幽靈必須作出決定：要麼做鬼，要麼重生為人。正當她為前路感到迷茫困擾，竟遇上一位同樣茫然惆悵但活生生的人類。兩人在柬埔寨壯麗自然景觀下低語相伴，在彼此中找到慰藉。導演首部劇情長片,以超現實角度回應柬埔寨大屠殺遺留的傷痕；社會遭逢巨變，新舊創傷不斷交織，但脆弱或能透過連結轉化為堅韌。人生縱然苦短，倘若有機會，你又會否選擇重生為人?",
    "runtime_minutes": 99,
    "director": "Polen Ly",
    "country": "柬埔寨",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/389?page=2",
    "category_id": "category-67",
    "title_en": "Becoming Human",
    "synopsis_en": "In modern-day Cambodia, young Hai visits a desolate cinema harbouring memories from his youth. There, he meets Thida, a young woman who reveals herself to be the \"Guardian Angel\" of the cinema. Its imminent demolition coincides with her reincarnation, and she can either remain an ethereal spirit in the cinema or be reborn with no past memories, which include her growing bond with Hai and the tragedies that befell her and her beloved Cambodia. Developed as part of the Venice Film Festival's emerging filmmakers programme, this genuinely charming and moving meditation on cinema, humanity and sombre history marks writer-director Polen Ly as an Asia talent to watch.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/389?page=2"
  },
  {
    "id": "film-396",
    "title_tc": "失明",
    "synopsis_tc": "或許我們不只用眼睛看(不)見。書儀擁有一切──「完美」的家庭、裝潢漂亮的大屋......直到一次異物入眼，書儀重遇當眼科醫生的初戀情人雪津，被迫直視心底抑壓已久的慾望。另一邊廂，雪津又因巧合認識了書儀的兒子天翰，天翰被雪津吸引，要求向兼任業餘攝影師的雪津學習攝影。從天翰的鏡頭，雪津看見了自己再回不去的、看待世界的角度。正當三人關係在試探與謊言之間糾纏不清，書儀確診罹患罕見眼疾，在逐漸失去光明的日子裏，到底書儀能否慢慢看見真正的自己?",
    "runtime_minutes": 142,
    "director": "周美豫",
    "country": "台灣",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/396?page=2",
    "category_id": "category-67",
    "title_en": "Blind Love",
    "synopsis_en": "A mother of two sons, housewife Shu-yi lives a seemingly idyllic upper-class life on the surface. However, she is trapped in a toxic marriage as a trophy wife for her ambitious and domineering doctor husband. Everything changes when she is reunited with Xue-jin, an ophthalmologist who was her former lover. The problem is that Shu-yi's older son has also fallen for Xue-jin. Thematically complex and quietly compelling, Julian Chou's psychosexual drama dissects the fluidity of sexuality and Taiwanese society's contradictory attitude towards the LGBT+ community. In a society plagued by prejudice, can love truly be blind?",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/396?page=2"
  },
  {
    "id": "film-431",
    "title_tc": "邦我搵老豆",
    "synopsis_tc": "小邦邦是東印少數族裔，充滿個性又膽生毛，不守禮道最愛麥當娜，但只會 Like a Virgin。面對老師和同學經常有意無意的訕笑，絲毫打擊不了小邦邦的自尊，繼續頑皮而不失霸氣地四處搗蛋，為鄉村小學帶來不少歡樂。正所謂無邦不起浪,他一心要給媽媽驚喜，與小雞丁老友偷偷出城，絞盡腦汁誓要將遠在城外工作失聯的爸爸帶回家。怎料越「邦」越狂，未知的世界為兩個傑出小學雞帶來無限的衝擊！《來自星星的 PK》副導首次執導長片，以孩童視角觸碰印度族群關係，小演員個個天真可愛，真摯動人。",
    "runtime_minutes": 94,
    "director": "Lakshmipriya Devi",
    "country": "印度",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/431?page=2",
    "category_id": "category-67",
    "title_en": "Boong",
    "synopsis_en": "The Indian region of Manipur may be plagued by ethnic conflicts, but that won't stop the tenacious titular hero of Lakshmipriya Devi's earnest directorial debut. When he hears rumours that his father – who works far away in a border town near Myanmar – has died, Boong decides to give his mother a surprise gift: His father's return. Soon, Boong and his best friend are venturing across the volatile region, relying on their unshakeable friendship to carry them through. Wholesome and moving, this deceptively simple children's adventure feels like the perfect remedy for the cynical world we live in now.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/431?page=2"
  },
  {
    "id": "film-392",
    "title_tc": "爆格預埋我",
    "synopsis_tc": "年輕竊賊誤闖老人家，發現屋內竟供奉着一尊藏着其亡妻遺體的石膏雕像。老人多年以此寄託思念，唯一心願是自己與愛妻一同埋葬在遙遠荒漠，竟自言「爆格唔緊要，最緊要預『埋』我」！原先只想闖空門的竊賊，卻闖進一場看似荒誕卻深情的告別之旅......越南新銳導演多年前讀到相關報道，念念不忘，決心拍出這段愛的故事。電影借鑒默片與西部片美學，以獨特圓形畫幅及精準構圖，塑造出強烈視覺風格，與遼闊沙漠形成鮮明對比,在黑色幽默與荒涼孤寂中不失溫柔詩意。",
    "runtime_minutes": 62,
    "director": "Nguyễn Lê Hoàng Phúc",
    "country": "越南",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/392?page=2",
    "category_id": "category-67",
    "title_en": "Bury Us in a Lone Desert",
    "synopsis_en": "For his stylistically mischievous feature directorial debut, Nguyễn Lê Hoàng Phúc plays with split screens, circular frames and every other visual trick a young filmmaker might think of to create an eccentric and utterly captivating drama. When an old man catches a young burglar in his home, the old man gives the would-be criminal an unusual task: Bring a plaster cast carrying the body of his long-deceased wife to the couple's resting place in the desert. Despite the macabre premise, this visually vibrant film is a surprisingly warm genre-blending exercise about grief.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/392?page=2"
  },
  {
    "id": "film-451",
    "title_tc": "攀過山峰遇見妳",
    "synopsis_tc": "成就了登上絕嶺的女子，上山難下山也不易。阪本順治最新力作，聚焦日本傳奇女性登山家田部井淳子的一生。1975年，她成為首位登上聖母峰的女性，並完成「七大洲最高峰」挑戰；她心繫崇山，追夢過程中挑戰種種身心極限、家庭與社會壓力，孤高之人同樣要在人後承受孤獨。豈料成就解鎖後，晚年與丈夫、好友相處，與自己身體共存，與受地震威脅的家園同行，才是對攀山家意志的最大考驗。雲集吉永小百合、佐藤浩市等重量級演員,在笑與淚之間看見頂峰以外的風景。",
    "runtime_minutes": 90,
    "director": "阪本順治",
    "country": "",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/451?page=2",
    "category_id": "category-67",
    "title_en": "Climbing for Life",
    "synopsis_en": "Women can do anything, including conquering Mt. Everest. And it was Junko Tabei who proved this in 1975 as the first woman to reach the world’s highest summit. The legendary mountaineer is fittingly embodied by another legend, Sayuri Yoshinaga, in Junji Sakamoto’s enthralling biopic about Tabei’s larger-than-life exploits amid ordinary life challenges. Though her inspiring journey was not always smooth, her life always shined bright – at times too bright for those closest to her. This grand story told in warm details follows from Tabei’s younger years as a plucky trailblazer to her later years battling illness, all the while living and climbing on her own terms.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/451?page=2"
  },
  {
    "id": "film-448",
    "title_tc": "共存得啖笑",
    "synopsis_tc": "艱難時，更應一笑置之? Noam 成長在一個猶太與阿拉伯人自願共存的和平綠洲，舉家是以色列極少數的以巴平權 L，從小接受共存教學，一直致力為巴人發聲。畢業後面對鐵般制度,夢想從政的她笑說受到烏克蘭啟發，毅然轉戰棟篤笑,用迷因救地球。笑話直搗中東禁忌，一夜爆紅,正當她確信笑彈可以化解仇恨之際，以巴戰爭再度爆發,徹底的擊潰了她。三十多年的信念，一息間被炸得支離破碎，連與自己也共存不了......歷時五年動盪歲月的拍攝，橫掃多個最佳紀錄片大獎，以笑聲思考和平的艱難。",
    "runtime_minutes": 95,
    "director": "Amber Fares",
    "country": "美國、法國",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/448?page=2",
    "category_id": "category-67",
    "title_en": "Coexistence, My Ass!",
    "synopsis_en": "Growing up in Neve Shalom, an \"oasis of peace\" where Israelis and Palestinians choose to live together, Noam Shuster Eliassi spent a large portion of her life advocating for human rights for both Israelis and Palestinians. As part of a peace project for Harvard University, Shuster Eliassi channels her passion into a comedy show that offers both laughs and hard truths. This award-winning documentary follows Shuster Eliassi's journey to create the show, made all the more difficult by the devastating violence unfolding at home. In the end, she makes a surprising argument why co-existence between the two sides is more impossible than ever.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/448?page=2"
  },
  {
    "id": "film-434",
    "title_tc": "這個毒販不太冷",
    "synopsis_tc": "在吉爾吉斯與哈薩克邊境，兩名毒販為錢途踏上一場艱險旅程，意外遇見剛從奴役中逃脫、滿身傷痕的女孩。正當他們試圖協助女孩越過邊界，她卻再度落入險境,他們決定不惜一切代價，也要將女孩帶回其家人身邊。中亞自然景觀壯麗,奔流不息的河水卻成為了人與人之間無法逾越的邊界。導演以離家工作卻慘被人口販賣的家人的親身經歷出發，探討人在壓迫下的道德兩難，以及內疚與遺憾如何塑造生命。",
    "runtime_minutes": 96,
    "director": "Dastan Zhapar Ryskeldi",
    "country": "吉爾吉斯",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/434?page=3",
    "category_id": "category-67",
    "title_en": "Deal at the Border",
    "synopsis_en": "Haunted by his brother's kidnapping by human traffickers years ago, director Dastan Zhapar Ryskeldi crafts a harrowing tale of survival that shows that doing the right thing can be a dangerous choice in some corners of the world. Shot on location near the Kyrgyzstan-Kazakhstan border, this gripping thriller follows drug runners Aza and Samat. When the two rescue a young woman who is escaping from human traffickers, Aza becomes attached to her – so much that when she is captured by criminals again, he decides to put his life on the line to save her.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/434?page=3"
  },
  {
    "id": "film-445",
    "title_tc": "加沙有個髮剪焗",
    "synopsis_tc": "加沙炎夏，難得今日有電供應，一眾女士把握時間去髮廊扮靚。豈料槍聲響起，眾女齊齊被困，原來受黑幫「解放獅子運動」波及。從待嫁新娘、即將臨盆的大肚婆、失婚婦到虔誠教徒,來自五湖四海的她們各懷心事。全世界恤髮都要等，大家索性閒話家常，談笑風生中流露戰爭日常的種種無奈與苦澀。一門之隔，炮火連連，髮廊內焦燥不安的氣氛，隨着突如其來的停電與哈馬斯警察部隊加入街頭槍戰而升溫。當十幾個女人被迫上演另類困獸鬥鬧劇，最終會失控爆煲、無辜喪命還是合力逃出生天？拿薩兄弟首部長片即殺入康城，改編自加沙真實獅子失竊案，黑色幽默呈現戰火陰霾下的無力感。",
    "runtime_minutes": 81,
    "director": "拿薩兄弟",
    "country": "巴勒斯坦、法國、卡塔爾",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/445?page=3",
    "category_id": "category-67",
    "title_en": "Degrade",
    "synopsis_en": "It's just another busy day in Christine's salon in the Gaza Strip as she welcomes female clients from all walks of life – a divorcee, a prescription drug addict, a bride-to-be and a pregnant woman. Suddenly a confrontation between the police and a local gang breaks out across the street, and the women become trapped in the salon. How long will it take before the besieged women turn on each other? Identical twin brothers Arab and Tarzan Nasser's single-set comedy-drama sets out to challenge stereotypical caricatures and explore the complexities of living as not just Palestinians, but as women in Palestine.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/445?page=3"
  },
  {
    "id": "film-449",
    "title_tc": "叢林保衛者",
    "synopsis_tc": "位於菲律賓的巴拉望天然資源豐富，是美景怡人的旅遊勝地。但隨着小島旅遊業愈趨繁盛,污染、破壞和非法商業活動亦隨之而來。島民不但要防範非法伐木及捕魚活動，同時還要對抗官商勾結，保護森林免被夷平作商業發展。電影記錄了「巴拉望非政府組織網路」用性命守護家園、守護自然，儘管力量微小,但仍誓不放棄。法新社資深記者出身的導演，曾以巴拉望保衛人士為題拍攝短片及寫成論文，獲國際特赦組織頒發亞太區人權獎特別獎，其後發展成其首部紀錄長片。",
    "runtime_minutes": 94,
    "director": "Karl Malakunas",
    "country": "美國、菲律賓、英國、澳洲、香港",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/449?page=3",
    "category_id": "category-67",
    "title_en": "Delikado",
    "synopsis_en": "For tourists, the Filipino island of Palawan is just a tropical paradise with Instagram-worthy sceneries. But to Bobby, Tata and Nieves, it is a home that they must fight to defend. Karl Malakunas's compelling Emmy-nominated documentary follows these three crusaders as they risk their lives to stop politicians and businessmen from illegally logging on the island. Also serving as an examination on the terrifying consequences of former president Rodrigo Duterte's drug war, this is an important story told with the tension of a great political thriller.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/449?page=3"
  },
  {
    "id": "film-436",
    "title_tc": "沙中瑰寶",
    "synopsis_tc": "「我覺得自己被死神盯上了。」東京中佬婚姻破裂，事業平平，剛為母親辦完葬禮，又目睹鄰居「孤獨死」，深怕要一支公走到人生盡頭。人生下半場，他要如何走下去？他跟隨母親的菲律賓看護,毅然踏上充滿活力與未知的馬尼拉。菲律賓新銳導演首部劇情長片，延續其紀錄短片對日本「孤獨死」的討論，請來 Lily Franky 擔綱飾演潦倒中年漢，與黑澤清合作多年的攝影師蘆澤明子掌鏡捕捉兩地人情冷暖，從文化差異反思人際關係和生命，在孤獨與失落之中再出發。",
    "runtime_minutes": 102,
    "director": "Janus Victoria",
    "country": "日本、馬來西亞、菲律賓",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/436?page=3",
    "category_id": "category-67",
    "title_en": "Diamonds in the Sand",
    "synopsis_en": "In Janus Victoria's poignant debut feature, divorced Tokyo salaryman Yoji confronts his greatest fear after discovering his neighbour's kodokushi, or lonely death, shortly after burying his mother. Refusing to accept a similar fate, he follows Minerva, his mother's Filipina caregiver, to the vibrant chaos of Manila. Lily Franky delivers a masterful performance as a man choosing uncertainty over solitude, while cinematographer Akiko Ashizawa beautifully captures both Tokyo's isolation and Manila's warmth. This cross-cultural journey transforms from a meditation on loneliness into an unexpected story of human connection and second chances.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/436?page=3"
  },
  {
    "id": "film-413",
    "title_tc": "哪一天我們會死",
    "synopsis_tc": "突如其來的死亡，究竟是一幅怎樣的風景？納華普延續《愛情悄悄來了》與《瑪莉瑪莉我好開心》的淡然筆觸與私密觀察，在虛構與真實之間自在切換，細細重構每則短小噩耗背後的暴風前夕。少女們在酒店房內交頭接耳，暢想未來;疏離多年的姊弟重逢時語塞無措，只能仰望天台上的雲卷風息；久病臥榻的妻子與丈夫正悠然共度午後，渾然不覺生死已再度洗牌。倒帶再倒帶，暫停再播放;鏡頭下，老人的神情毫無防備，孩童臉上卻閃過一絲戒心，皆是面向死亡。",
    "runtime_minutes": 75,
    "director": "納華普譚容格坦拿列",
    "country": "泰國",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/413?page=3",
    "category_id": "category-67",
    "title_en": "Die Tomrrow",
    "synopsis_en": "If death comes unexpectedly, that means our last day in this world is often just like any other ordinary day. For his follow-up to commercial breakout hit Heart Attack, Nawapol explores our bizarre relationship with mortality with this essay-style anthology, featuring six slice-of-life vignettes about people who have no idea that they are about to meet their maker. Mixing fictional scenes, found footage, audio recordings, interviews and statistics, the director’s return to his experimental roots may keep death on the tip of its tongue, but it’s an unexpectedly affirming and inquisitive film about what it means to live.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/413?page=3"
  },
  {
    "id": "film-439",
    "title_tc": "奪目短片獎2025：得獎作品巡禮",
    "synopsis_tc": "一塊燒焦的牛扒 (2023 / 8’12” / 無對白)\n導演：Kiarash Dadgar\n牛扒、氣球、生日蛋糕⋯⋯一位母親為女兒精心準備的生日派對，是否能如願舉行？\n\n一路有你 (2025 / 21”48” / 英語)\n導演: 蕭韻心\n年過 50 只能百無聊賴做師奶？Norah 和 Susie 選擇踏上自由與勇氣的旅程，打破大家對新加坡同志戀人的想像！\n\n活得太認真了吧 (2023 / 4’47” / 粵語)\n導演: 楊志遠\n本地樂隊 KOWLOON.K 認真演繹，化身糾察及改造小隊，「認真L」逐個捉！\n\n背負石化龜 The Tortoise (2025 / 13’28” / 波斯語)\n導演: Amirreza Jalalian\n一位臉上張著石塊、面無表情的年輕軍人，迫不得已返鄉安葬自殺的父親。世代流傳的古老文明，是否仍要子承父孽？\n\n膠林密語 (2025 / 12’38” / 客家語)\n導演: 張蔚韻\n老人在被砍伐的橡膠園中醒來，卻發現自己身處過去的殖民時代。隨著那首古老的民謠，他陷入永無止境的割膠循環之中。\n\n九宵 (2025 / 16’33” / 粵語)\n導演: 桂濱、黃浩然\n全由 AI 生成的科幻劇情短片。直到神秘女子闖入前，社畜阿康都滿足於每天在太空站重複的日常，唯一訴求只有兩日後見阿哥！\n\n邊界感 (2025 / 11’33” / 無對白)\n導演：李世恩\n不能夠為自己設立邊界，後果可以有多嚴重？從忍受旅遊巴阿朱媽倒放座椅開始，代入後座 I 人，一齊探索人際關係與社會空間。\n\n我是貓 (2023 / 14’17” / 廣東話)\n導演：梁錦輝\n無家可歸的啞巴在荒野流浪，遇上一個愛貓成癡的盲人。盲人樂此不疲餵飼村落裡每一隻流浪貓，啞巴從中看到被收養回家的契機。",
    "runtime_minutes": 90,
    "director": "",
    "country": "",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/439?page=3",
    "category_id": "category-67",
    "title_en": "Eye Catcher Global 2025: Short Awards Winners Highlights",
    "synopsis_en": "The Steak (2023 / 8’12” / No Dialogue)\nDir. : Kiarash Dadgar\nThe steak, the balloon, the birthday cake... Will a mother’s well-prepared birthday party for her daughter go as planned?\n\nTwo Travelling Aunties (2025 / 21’48” / English)\nDir.: Christine Seow\nOver 50 and stuck in a dull auntie (C9) routine? Norah and Susie choose to embark on a journey of freedom and courage, breaking your imagination about same-sex couples in Singapore!\n\nDo We Live Too Seriously (2023 / 4’47” / Cantonese)\nDir.: Ven Yang\nLocal band KOWLOON.K delivers their serious performance, transforming into an inspection and reform squad, catching everyone who lives too seriously one by one!\n\nThe Tortoise (2025 / 13’28” / Persian)\nDir. : Amirreza Jalalian\nA young soldier with a stone face is forced to return home to bury his committed suicide father. Must the burdens of an ancient civilization continue to pass from father to son?\n\nLatex Labyrinth (2025 / 12’38” / Hakka Chinese)\nDir.: Wey Yinn Teo\nAn old man awakens in a deforested rubber estate and finds himself in the colonial past. A distant old folk song ripples as he falls into the eternal loop of rubber tapping.\n\nNine Awaken (2025 / 16’33” / Cantonese)\nDir.: Kwai Bun, WHY Amos\nFully AI-generated drama sci-fi short film. Until a mysterious woman barged in, Kong was comfortable with his repetitive daily routine on the space station, with his only wish being to see his brother two days later!\n\nBoundaries (2025 / 11’33” / No Dialogue)\nDir.: Seun Yee\nHow serious can the consequences be if you can’t set boundaries for yourself? Starting with tolerating the auntie who overly reclined her bus seat, the passenger behind takes an unexpected path, eventually exploring the interpersonal and societal space.\n\nSave my soul (2023 / 14’17” / Cantonese)\nDir.: Leung Kam Fai\nA mute wanderer, homeless and alone, meets a blind man smitten with cats. The man feeds every stray in the valley, offering the mute a chance for home.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/439?page=3"
  },
  {
    "id": "film-415",
    "title_tc": "神速特攻隊",
    "synopsis_tc": "追夢唔係大晒！頂級競技疊杯選手阿高醉心練習，冷落了悉心照顧他、為他付出所有的女友小潔，兩人因而分手。阿高努力追逐世界冠軍，希望贏回小潔的歡心，同時由零開始學習打理生活雜務的他快要被瑣事擊潰，但他不是一個人在戰，他身邊一眾騎呢好友個個使出渾身解數，誓要幫他奪得冠軍！納華普首次執導愛情「動作」喜劇，在搞笑底下繼續探討生活與愛情，透過冷門體育項目描繪一個有關成長、愛情和夢想的感人故事，同時不忘向多齣經典電影致敬。",
    "runtime_minutes": 132,
    "director": "納華普譚容格坦拿列",
    "country": "泰國",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/415?page=3",
    "category_id": "category-67",
    "title_en": "Fast & Feel Love",
    "synopsis_en": "After making a sobering contemplation of romantic trauma with Happy Old Year, Nawapol returns to the comedy genre with an inspired effort that finally brings together competitive sport stacking, arrested development, and a love of Hollywood action films. Already in his thirties, Kao only has one goal in life: to become the fastest sport stacker in the world. But when his long-suffering girlfriend Jay becomes fed up with taking care of him and decides to leave, Kao is suddenly forced to learn to become an adult while trying to fulfill his sport stacking dream and win Jay back.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/415?page=3"
  },
  {
    "id": "film-444",
    "title_tc": "一個巴勒斯坦家庭的故事",
    "synopsis_tc": "首部在加沙拍攝的紀錄片，追踪賈巴利亞難民營一個家庭的日常生活：祖輩被驅離家園，滯留在軍事統治的加沙地帶 40 多年，一家大小活在瓦礫、貧困和恐懼之中，小孩不知何處是家。加沙難民的人道困境如何造成？誰又需要負責？始作俑者侃侃而談，軍人視之為理所當然，交錯對比着加沙居民每天面對的無力現實，勾勒出戰爭在巴勒斯坦人身上留下的沉痛後遺。",
    "runtime_minutes": 82,
    "director": "Pierre Björklund, Per-Åke Holmquist, Joan Mandell",
    "country": "巴勒斯坦、瑞典",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/444?page=3",
    "category_id": "category-67",
    "title_en": "Gaza Ghetto: Portrait of a Palestinian Family",
    "synopsis_en": "The first documentary shot in Gaza, the film follows the Abu el-Adel family in Jabalia, the largest refugee camp in Gaza. Abu, the oldest member of the family, recounts three significant events in their lives – the 1948 exile that forced them to flee from their home, the 1967 war that saw Abu refuse to flee again, and the 1971 \"pacification campaign\" that saw his son imprisoned. Intimate scenes of family life are intercut with interviews with the architects of the Palestinian occupation and Israeli soldiers discussing their work with pride. This landmark work exposes the root of violence that continues to unfold today.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/444?page=3"
  },
  {
    "id": "film-419",
    "title_tc": "源泉館主人",
    "synopsis_tc": "異色滿滿、充滿超現實色彩的四部短篇故事，挑戰你官能界限！漫畫家津部暫住在李先生家一樓，平淡的生活卻被李先生詭異舉動打斷；少女替酗酒父親看守旅館，卻莫名地走進河流誕出紅之花；男人來到只有老人的小鎮，被指長得像以前的源泉館主人，隨即憶起當年和老闆娘初見面的激情；潦倒的津部想靠出版小鎮情報誌徵收廣告費，沒想到聘請回來的經紀夾帶私逃......日本Cult 片大師石井輝男改編柘植義春四篇漫畫，佐野史郎出演的漫畫家角色津部以柘植為原型，更獲柘植夫婦友情出演，不可錯過。",
    "runtime_minutes": 99,
    "director": "石井輝男",
    "country": "日本",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/419?page=3",
    "category_id": "category-67",
    "title_en": "Gensen-Kan Inn",
    "synopsis_en": "Directed by the \"King of Cult\" Teruo Ishii, this anthology adapts four short stories by Yoshiharu Tsuge, transporting the audience into his surreal universe. The journey begins with a quirky landlord who claims to communicate with birds, followed by a young woman who gives birth to crimson flowers. Next, we meet a visitor in a ghostly village who is mistaken for the local innkeeper. The collection concludes with a hapless young man hoping to strike it rich by publishing a town guide funded by ad sales. Each tale encapsulates the signature, dreamlike absurdity of Tsuge's work, evoking a uniquely atmospheric experience.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/419?page=3"
  },
  {
    "id": "film-414",
    "title_tc": "無痛斷捨離",
    "synopsis_tc": "設計師阿靜受風靡新世代的簡約風影響，決心打造主打留白、空間感十足的家居。在進行大掃除期間，阿靜對多樣舊物與其封存的回憶都隨意捨棄，只有前男友遺下的舊相機令她份外揪心。阿靜對自己當年不辭而別耿耿於懷，決定親手把這相機歸還給前男友，讓自己有機會彌補遺憾。但重整人生不如重整家居，清得走物品，卻捨不得舊人，原來唯獨感情難以輕言斷捨離。納華普以同樣簡約的影像風格，冷靜聚焦當代人的情感關係，細膩捕捉人與人之間的疏離與親近。",
    "runtime_minutes": 113,
    "director": "納華普譚容格坦拿列",
    "country": "泰國",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/414?page=3",
    "category_id": "category-67",
    "title_en": "Happy Old Year",
    "synopsis_en": "To convert her house into a minimalist home office, Jean begins a massive decluttering project. Her rule is simple: anything that has been lying around unused gets thrown out. But she hits a wall when she unearths items belonging to her ex-boyfriend, Aim. Each object is a gateway to a flood of memories and unresolved feelings – emotions that can't simply be tossed into a garbage bag. With his minimalist visual style, Nawapol calmly focuses on the emotional relationships of this generation, delicately capturing the eternal push and pull between distance and intimacy.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/414?page=3"
  },
  {
    "id": "film-412",
    "title_tc": "戀愛病發",
    "synopsis_tc": "如果 30 歲還是自由身設計師，似乎就能成為五天不睡覺的魔法師。又或者如果有泰國做設計慘過食屎協會，設計師阿翁應該就是會長。電腦全天候跟身，連出席葬禮都「幫緊你幫緊你」。客人日改夜改，阿翁終於工作過度出紅疹，健康響起警號，事業面臨危機。塞翁失馬，他遇上年輕貌美的醫生，她教他重新調整生活,漸漸連他的心也被撩動。到底應該瘋狂地幹活一生，還是痛快地戀愛一場？納華普從獨立電影起家，首度與大型電影公司合作，夥拍男女神級演員陣容，橫掃泰國電影金像獎八項大獎,成功走入主流而不落俗套。",
    "runtime_minutes": 132,
    "director": "納華普譚容格坦拿列",
    "country": "泰國",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/412?page=3",
    "category_id": "category-67",
    "title_en": "Heart Attack",
    "synopsis_en": "After festival-friendly indie darlings 36 and Mary is Happy , Mary is Happy, Nawapol makes a hugely successful foray into commercial filmmaking with Heart Attack. Yoon is one of the best freelance graphic designers in town. When a five-day sleepless work streak leads to rashes on his body, Yoon goes to the public hospital and meets a gorgeous young doctor who demands Yoon put his life back on track. Based on the experiences of the filmmaker and his fellow freelancer friends, Heart Attack is a hilarious and painfully relatable portrayal of freelance life that will win you over with irresistibly charming humour and plenty of heart.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/412?page=3"
  },
  {
    "id": "film-427",
    "title_tc": "香港動畫短片集",
    "synopsis_tc": "不忠之愛 (2018 / 6min / 粵語)\n導演︰麥少峯\n男人三妻四妾是不忠。女人跟佬走也是不忠。情郎背叛愛人同為不忠。最後剩下的是否只有被支配的愛?\n\n房間裏的你 (2024 / 7min / 無對白)\n導演︰石家俊\n四個房間，四段記憶。獄中父親長年缺席，兒子在探訪中走進回憶的隧道，嘗試在間裏重拾記憶中父親的模樣。\n\n夏夢迴 (2023 / 14min / 粵語)\n導演︰陳嘉言、黃曉傑\n金魚能否回歸野生容貌，只有「牠」才知曉。那回歸自我的季候風，卻正騷動不安。\n\n極夜 (2021 / 13min / 粵語)\n導演︰張小踏\n一個如何面對恐懼的故事。極夜總會過去。\n\n離騷幻覺 — 序 (2020 / 15min / 粵語)\n導演︰江康泉\n如果靈魂的歸宿只在乎軀殼，人與機械人有分別嗎？求生與尋死是否指向同一真相？\n\nMy Dear Son (2022 / 9min / 無對白)\n導演︰傅詠欣\n母親以她自己的理想撫養初生兒子,試圖改變他本來的樣貌。\n\n殺死丁力2帝國反擊戰 (2024 / 26min / 粵語)\n導演︰羅絡熙、胡孝宗、梁俊達\n鐵拳和愛犬丁力的幸福生活被一場突如其來的襲擊粉碎。愛犬被殺,鐵拳被囚。他必須聯同改造犬巢皮復仇。",
    "runtime_minutes": 90,
    "director": "",
    "country": "",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/427?page=3",
    "category_id": "category-67",
    "title_en": "HK Animation Shorts",
    "synopsis_en": "Infidelity (2018 / 6min / Cantonese)\nDir: Mak Siu Fung\nAll are infidelity - a man gets himself wives and concubines, a woman runs away with a man, or a lover betrays his love. What remains is the love of domination.\n\nFather Figure (2024 / 7min / No dialogue)\nDir:  Isaac Shek Ka Chun\nFour rooms, four memories. The son steps into a tunnel of recollection during a visit to his long-absent father in prison, attempting to rediscover the visage of his father.\n\nMonsoon Blue (2023 / 14min / Cantonese)\nDir: Ellis Chan Ka Yin, Jay Wong Hiu Kit\nThe dream of a goldfish to return to its wild form evokes her long-forgotten memories, while a self-conscious monsoon is about to pour.\n\nDepths of Night (2021 / 13min / Cantonese)\nDir: Step C.\nA story of how to face fear. Depths of night will eventually pass.\n\nDragon’s Delusion: Preface (2020 / 15min / Cantonese)\nDir: KongKee\nIf our soul needs a shell, how does a human differ from a robot? What if the search of life or death leads only to the same truth?\n\nMy Dear Son (2022 / 9min / No dialogue)\nDir: Lilian Fu\nA mother raises her new born son in her ideals: trying to be like what they are not.\n\nKill Danny II: A Puppy Love Story (2024 / 26min / Cantonese)\nDir: Law Lok Hei, David Wu, Jason Leung\nAfter assassins kill his beloved dog Danny and imprison him, Iron-Fist must team up with Foreskin the luggage-hybrid dog for revenge.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/427?page=3"
  },
  {
    "id": "film-384",
    "title_tc": "香港第一 Short",
    "synopsis_tc": "鳶緣如風 (16min / 粵語)\n導演: 李嘉賢\n公屋女生阿風的家園清拆在即,鄰居老友相繼搬走,新來的朋友卻要帶她展開一場奇幻旅程。\n\n卡利俄佩的凝視 (11min / 英語、德語)\n導演: 郭頌儀\n女生扮演希臘女神卡利俄佩，供畫家們作畫，卻在眾人目光之下漸漸變成一尊雕像。\n\n中場休息 (27min / 普通話)\n導演: 蔡芩羽\n和男友的爭執正達高潮，她按下了暫停鍵，並跟閨密分析這場由情侶鬥嘴演變成性別辯論的鬧劇。\n\n以記憶之名 (13min / 粵語)\n導演: 劉詠淇\n孩子與母親之間的是血脈？是關係？還是記憶的縫隙？\n\n跌咗真係搵？ (20min / 粵語、葡語)\n導演: 楊螢映\n一個剛殺青的劇組，一張消失的記憶卡，一個荒誕混亂瘋狂的晚上。\n\n天華幫 (15min / 粵語)\n導演: 陳素嘉\n來自天華邨的四個孩子，他們一同遊戲，一同探險，一同製造四個不一樣的童年。",
    "runtime_minutes": 90,
    "director": "",
    "country": "",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/384?page=4",
    "category_id": "category-67",
    "title_en": "Hong Kong Shorts – Programme 1",
    "synopsis_en": "Wind Goes On (16min / Cantonese)\nDir: Eric Lee\nWaving off neighbours from her soon-to-be-demolished childhood home, Fung was led by a newfound friend to take on a fantastic journey.\n\nShe is Calliope (11min / English, German)\nDir: Erica Kwok\nA model poses as the goddess Calliope slowly becoming the statue under the gazes of a group of painting students.\n\ntake a break (27min / Putonghua)\nDir: Cai Qinyu\nA couple's quarrel over petty grievances escalates into a gender debate – with a surrealistic dissection as each line was paused and deconstructed.\n\nIn the Name of Memory (13min / Cantonese)\nDir: Ariel Lau\nAre children and their mother bonded by blood, by relationship, or by an invisible gap within the streams of memories?\n\nKeep Looking? (20min / Cantonese, Portuguese)\nDir: Anna Ieong\nOne film crew, a missing memory card, and a night of unforgettable disaster.\n\nLast Summer (15min / Cantonese)\nDir: Sugar Chan\nWandering in the Tin Wah Estate, four kids explore friendship and their childhoods through a hide-and-seek game.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/384?page=4"
  },
  {
    "id": "film-385",
    "title_tc": "香港第二 Short",
    "synopsis_tc": "芳草碧連天 (26min / 粵語、普通話)\n導演: 吳松擎, 王皓明\n曾同處一段開放式關係中的 Leila 和舒雯，在伴侶的葬禮上初遇，決定一同送愛人去她最後想去的地方。\n\n眼淚的果實 (4min / 無對白)\n導演: 陳欣儀\n男人在一個與世隔絕的空間中徘徊，無法言說的心事在封閉的角落中蠕動。突然,一滴眼淚闖了進來。\n\n季候鳥 (30min / 粵語)\n導演: 吳思龍\n香港街頭表演者麗兒與導演在迷人的瑞士小鎮，一邊參與藝術節演出，一邊記錄表演者們的季候鳥人生。\n\n後殖民皇后 (13min / 粵語、英語)\n導演: 薛學誠\n以舞蹈和城市視覺拼貼成一幅諷刺香港複雜身份的圖畫，集體記憶和個人故事交融，反思城市的歷史。\n\nRemnants (7min / 英語)\n導演: 白標仁\n天生唇顎裂的女子奮力對抗藏在心底的手術創傷後遺，在痛苦噩夢中尋找力量與接納。\n\n貓與雞 (25min / 國語、台語)\n導演: 朱凱濙\n阿嬋家的雞舍被大風吹垮，雞群四處逃散，但此時她和八十多歲的母親卻有更緊迫的事情要處理，只為給貓咪小乖一個體面而溫暖的告別。",
    "runtime_minutes": 90,
    "director": "",
    "country": "",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/385?page=4",
    "category_id": "category-67",
    "title_en": "Hong Kong Shorts – Programme 2",
    "synopsis_en": "Last but not Least (26min / Cantonese, Putonghua)\nDir: Sylvie Wu, Holly Wang\nLeila and Shu Wen, once entangled in the same open relationship, first met at their lover's funeral, and decided to take her ashes with them.\n\nTear Tear Fruit (4min / No dialogue)\nDir: Paprika Chan\nA man cries through his body and improvised movements, and a tear responded.\n\nBird of Passage (30min / Cantonese)\nDir: Dino Ng\nA documentary on the daily life of local street performer Lai Yee as he showcases his talents to the charming Swiss town of Vevey.\n\nPostcolonial Queen (13min / Cantonese, English)\nDir: Zack Sit\nA collage that satirises Hong Kong's complex identity through dance and city visuals, interrogating its history by intertwining collective memories and personal stories.\n\nRemnants (7min / English)\nDir: Brock R. Brahmes\nBattling with her trauma of surgery, a woman who used to have cleft lip slowly finds strength and acceptance within herself.\n\nAfter the Cat (25min / Mandarin, Taiwanese)\nDir: Chu Hoi Ying\nA pair of elderly mother and daughter put aside their storm-struck chicken coop to look for a way to cremate their beloved cat, trying to give their late pet peace and grace.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/385?page=4"
  },
  {
    "id": "film-386",
    "title_tc": "香港第三 Short",
    "synopsis_tc": "Tape (6min / 無對白)\n導演: 許詠琪\n一塊膠紙勾起女孩對家的回憶，那些滿是膠紙修補痕跡的老舊傢俱，把她困在回憶與虛幻的內心世界，越掙扎逃離卻越被黏緊。\n\n擇鳥記 (17min / 粵語)\n導演: 張紫茵\n身份與家園是香港人長久以來的課題,導演探問紮根、二度植根和生長的意義，反思人類與土地之間不斷演變的關係。\n\n我照跑 (16min / 粵語)\n導演: 人宇宙\n三十歲的阿希自幼在沙田長大，某日他在馬場解開了自己與社區的不解之緣，終於可以按照自己的腳步奔跑。\n\n離風藍蘭 (5min / 普通話)\n導演: 陳嘉言\n如夢似真，小女孩穿越過去和現在，尋找屬於自己的藍鳥。她到底是在追逐幻影，還是藍鳥早已在她心中?\n\n孤奕 (25min / 粵語)\n導演: 潘嘉輝\n小五學生晉安為精進棋藝，向擺象棋殘局行騙的大叔尋求指導，兩人在虛假的謊言中建立出真實的情感。\n\n蛾與我 (22min / 粵語)\n導演: 陳英吉\n任職地產的吉仔，生活和工作皆不順，失眠令他難以分辨惡夢與現實。就在他以為人生不能更糟的時候，突然發現自己不育了。\n\n入土為慌 (10min / 粵語)\n導演: 莊世圖\n血月高掛的晚上，兩個男人在荒山野嶺中相約露營，還有埋屍。",
    "runtime_minutes": 90,
    "director": "",
    "country": "",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/386?page=4",
    "category_id": "category-67",
    "title_en": "Hong Kong Shorts – Programme 3",
    "synopsis_en": "Tape (6min / No dialogue)\nDir: Candace Hui\nA piece of plastic tape takes a young woman on an emotional journey through memories of her home that she thought were long forgotten.\n\nas a bird that briefly perches (17min / Cantonese)\nDir: Dorothy Cheung\nIdentity and homeland are long-discussed subjects of the Hong Kong diaspora. What might the implications be as we re-root ourselves onto foreign soil?\n\nHorse Person (16min / Cantonese)\nDir: Person Universe (Lam Ying Hei, Ho Pak)\n30-year-old Hei grew up in Sha Tin. As he aimlessly runs every day to escape from his broke family, he realises his true pursuit is in the pure speed of a horse.\n\nBluebird in the Wind (5min / Putonghua)\nDir: Ellis Chan\nA girl journeys through her past and present in search of her own Bluebird. Is she chasing after a dreamy shadow, or has the bird already emerged from within?\n\nLost Cause (25min / Cantonese)\nDir: Poon Ka Fai\nOn, a primary school boy, seeks guidance from a Chinese chess scammer, who sets up endgames in the park. The two lonely souls find solace in their mentorship as they lie their ways out.\n\nMoth & I (22min / Cantonese)\nDir: Oliver Chen\nLucky Chan is an anxious real estate agent who is never lucky. Caught between nightmares and daydreams, he found his boner dry up on him.\n\nA Night to Bury (10min / Cantonese)\nDir: Chong Sai To\nIn a night woven with mushroom soup and hallucinations, two brothers met in the mountain for camping – and burying their late father's body.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/386?page=4"
  },
  {
    "id": "film-432",
    "title_tc": "綠在追追大作戰",
    "synopsis_tc": "去屆焦點影人、日本導演吳美保最新力作，靈感來自環保少女 Greta Thunberg 名言「How dare you」。鍾情昆蟲的小學生唯士因一次班上演講，暗戀為環保大聲疾呼的女生。為了追女仔，唯士與同學發起一連串「環保行動」，派傳單放火箭偷偷放牛牛，人細膽大鬧出不少笑話。大人造成的問題，難道要下一代承受惡果？吳美保以孩童視角切入「世代之爭」，找來蒼井優、瀧內公美飾演孩子們的母親，幽默折射童稚蒙昧的情感，雖然橫衝直撞，但初衷美好。",
    "runtime_minutes": 97,
    "director": "吳美保",
    "country": "日本",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/432?page=4",
    "category_id": "category-67",
    "title_en": "How Dare You",
    "synopsis_en": "An unconventional children's film that should spark conversations between adults and kids, this thoughtful and lighthearted romp from Mipo O (21st HKAFF Director in Focus) follows a group of children who set out to change the world. Yuishi develops a crush on a classmate after hearing her impassioned speech about climate change, so he tries to impress her by taking up her cause. Eventually, they turn to mischief in the name of the environment. Eliciting amazingly natural performances from her young cast by shooting at a child's height with free-roaming cameras, O once again proves herself to be a keen and humanistic observer of people, regardless of age.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/432?page=4"
  },
  {
    "id": "film-416",
    "title_tc": "Human Resource",
    "synopsis_tc": "任職 HR 的 Fren 這個月鬱鬱寡歡，除了忙於填補惡毒老細再次鬧走人的空缺，還要為決定胎兒的去留而苦惱。空氣污染微塑，經濟衰退但水浸遲遲未退，留學歸來的富二代能要求持股做僱員福利，從未出國的新鮮人卻要返足六日包受氣。招聘和求職要付出多少金錢和代價？胎兒尚未成形，然而在日復日的面試中，已窺見未來的庸碌乏味、焦慮與失落。人類在這個世道該怎樣自處？導演借招聘難題探討人類在科技支配下的困局及被科技操控下的精神狀態，對當代社會的批判一針見血。",
    "runtime_minutes": 122,
    "director": "納華普譚容格坦拿列",
    "country": "泰國",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/416?page=4",
    "category_id": "category-67",
    "title_en": "Human Resource",
    "synopsis_en": "Fren, working in HR, faces an existential crossroads when she discovers she's one month pregnant. As she interviews countless young job candidates at her company, their stories of hope, anxiety, and uncertainty become a mirror for her own internal struggle about bringing new life into an increasingly complex world. Through deliberate pacing and subtle performances, acclaimed Thai director Nawapol Thamrongrattanarit delves into modern dilemmas, exploring contemporary questions about life, parenthood, and the changing nature of human existence in an era of declining birth rates globally.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/416?page=4"
  },
  {
    "id": "film-430",
    "title_tc": "7天",
    "synopsis_tc": "男孩擁有特殊能力，能夠看到每人頭上的隱藏數字，象徵他們與戀人的相愛時長。與女孩意外邂逅、一見鍾情，更意料不到的是他們戀愛的時間——只有短短七天。面對已知結局的愛情，男孩想把握當下每分每秒，將七天過成一輩子,女孩卻提出讓時間停下的辦法，試圖對抗命運的安排。《風中有朵雨做的雲》編劇邱玉潔包辦編導，以女性角度細膩描繪愛情的熾熱和慾望，蔣奇明與張藝凡擔綱主演譜寫非一般浪漫戀曲，在永恆與朝夕之間相愛相守，在轉瞬即逝的時光裏用力相擁。",
    "runtime_minutes": 122,
    "director": "邱玉潔",
    "country": "中國",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/430?page=4",
    "category_id": "category-67",
    "title_en": "I Swear",
    "synopsis_en": "Dentist Chen Choushi possesses an unusual gift – or curse: he can see exactly how long relationships will last. When he falls for the enigmatic Wen Qian, he discovers their love is destined to last only seven days. Determined to defy fate, they devise an unconventional plan: meeting once every seven years to stretch their brief romance into eternity. Written and directed by Qiu Yujie, this enchanting romantic fantasy captures the burning intensity of love and desire, as two souls navigate between eternal promises and fleeting moments, determined to make every embrace count.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/430?page=4"
  },
  {
    "id": "film-429",
    "title_tc": "不丹一個我",
    "synopsis_tc": "不丹，結合原始群山與現代化都市的國度，一首失落的古老歌謠牽動兩個女性的命運。因一段網上流傳色情影片，老師身陷流言蜚語。為了尋找影片中與自己極其相似的女子，她踏上旅程、走入陌生村莊，怎料反被人確信是該女子的分身。旅途上她意外得知一首神聖的歌謠被人偷去，在身份、靈魂與民族記憶的迴廊愈走愈遠。《山中查案記》導演巧借兩生花意象，雙重身的幻象與失落的傳統，交織成一場當代不丹女性寓言。",
    "runtime_minutes": 112,
    "director": "Dechen Roder",
    "country": "不丹、法國、挪威、意大利",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/429?page=4",
    "category_id": "category-67",
    "title_en": "I, the Song",
    "synopsis_en": "Director Dechen Roder (Honeygiver Among the Dogs) considers her nation's rapid plunge into modernity and the price paid for it with this introspective and dreamy mystery. When schoolteacher Nima is wrongly fired for a viral pornographic video featuring a woman who looks just like her, she sets out to clear her name by finding her doppelgänger. However, the more Nima learns about her doppelgänger's life and her ties to a \"stolen\" sacred song, Nima's journey becomes a mystery that she must solve. Accompanied by traditional Dzongkha music, Roder's story of exploitation and cultural identity is an atmospheric and poetic experience.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/429?page=4"
  },
  {
    "id": "film-422",
    "title_tc": "垃圾頭",
    "synopsis_tc": "在未來世界，人類透過基因改造，終於可以長生不老，但卻無法再孕育後代。然而，在千多年前被創造出來作為勞力的複製人，似乎在接管地下世界後進化出繁殖能力！？於是，人類開展地底探索任務，力圖尋找失去的基因密碼，拯救人類未來！導演堀貴秀自學動畫,從角色設計、建模及布景，到拍攝、剪接、配音、配樂等皆一手包辦;獲獎短片獲《忘形水》導演吉拿域戴拖路盛讚為「瘋狂且優秀之作」，長版耗時七年製作，一躍成為想像力與視覺風格同樣強烈的獨立動畫傳奇。",
    "runtime_minutes": 100,
    "director": "堀貴秀",
    "country": "日本",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/422?page=4",
    "category_id": "category-67",
    "title_en": "Junk Head",
    "synopsis_en": "In the distant future, mankind attains longevity through gene manipulation, but the compensation is the loss of natural reproduction. Meanwhile, their clones, who rebelled 1,600 years ago and now rule the bottomless underworld, seem to have become fertile. The government sees this as hope to rescue mankind from extinction and sends civilians in to carry out an ecological study. Seven years in the making, director Takahide Hori's solo tour de force – from puppet sculpting to scoring – has been praised by Guillermo del Toro as a \"work of deranged brilliance\", crafting a stop-motion masterpiece that evokes H.R. Giger's dark imagination.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/422?page=4"
  },
  {
    "id": "film-423",
    "title_tc": "垃圾世界",
    "synopsis_tc": "日本獨立定格動畫傳奇《垃圾頭》相隔八年終於推出續集兼前傳！故事設定在人類展開地底任務的千年前，人類與複製人會面嘗試締結盟約，怎料遭受一場動機不明的襲擊，被迫共同前往一座荒廢城市展開調查，效忠人類的最新型機器 Robin 竟意外被捲進時空傳送門，開啟「垃圾世界觀」更多未知的篇章......自學成才的動畫導演堀貴秀，今次由一人團隊擴展六人，技術全面升級，依然維持低成本與獨立製作的精神，延續誇張怪趣的幽默風格，以奇異敘事與獨特視覺語言，再次展現動畫的無限可能。",
    "runtime_minutes": 104,
    "director": "堀貴秀",
    "country": "日本",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/423?page=4",
    "category_id": "category-67",
    "title_en": "Junk World",
    "synopsis_en": "The result of seven years' hard work, Junk Head was a bizarre stop-motion futuristic fantasy that interior designer and self-taught filmmaker Takahide Hori made almost entirely by himself. Thanks to its success as a cult film, Hori continues his planned trilogy with a prequel that is far more ambitious, though just as grotesque and eccentric as its predecessor. Set over 1,000 years before Junk Head, Junk World sees humans and Mulligans – an artificial life form that revolted against human rule after achieving consciousness – creating an uneasy alliance as they fight a time-travelling battle against a radical faction of Mulligans.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/423?page=4"
  },
  {
    "id": "film-391",
    "title_tc": "左撇子女孩",
    "synopsis_tc": "單親媽媽淑芬與兩個女兒從鄉下遷回台北，在夜市擺攤謀生。大女宜安生性叛逆,執意要做檳榔西施；五歲細女宜靜好動，對世界充滿好奇，直到外祖父以「惡魔之手」為名矯正她的左撇子，家族長年抑壓的秘密隨之浮現，也徹底改變女孩對自己與世界的看法。鄒時擎首部獨立執導長片，與長期創作夥伴辛貝克共同編劇，以鮮活影像將台灣夜市變成夢幻樂園。五光十色背後是生活重擔、是家族牽絆的溫暖，也是傳統家庭枷鎖與自我探索的拉扯，交織出真實又富詩意的家庭圖像。",
    "runtime_minutes": 109,
    "director": "鄒時擎",
    "country": "台灣、法國、美國、英國",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/391?page=4",
    "category_id": "category-67",
    "title_en": "Left-Handed Girl",
    "synopsis_en": "In her remarkable solo directorial debut, Tsou Shih-Ching crafts an intimate portrait of three generations wrestling with tradition and change in modern Taipei. After moving from the countryside, single mother Shu-Fen and her daughters– rebellious twenty-year-old I-Ann and curious five-year-old I-Jing – struggle to make ends meet running a night market noodle stall. When I-Jing's grandfather condemns her left-handedness as demonic, family secrets begin to surface. Co-written and produced by Sean Baker, this tender exploration of family bonds and quiet rebellion pulses with the vibrant energy of Taipei's neon-lit streets.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/391?page=4"
  },
  {
    "id": "film-406",
    "title_tc": "幸福之路",
    "synopsis_tc": "穿梭紐約市送餐的華人外賣仔，因搵食架撑電動單車被盜，生活陷入危機。同時，他的妻女在分離五年後，終於來到紐約重聚。一部書寫移民勞工的電影，鏡頭隨着無法停下的外賣單車徘徊飄移，配以幽暗色調的紐約街頭，彷佛在高度資本發達的城市中，刻劃出邊陲移工艱苦曲折的生存軌跡。韓裔加拿大導演於2022 年以短片《老樣子》入圍康城短片競賽，其後將短片延伸成為其首部劇情長片，不變的是對移民群體的關注。",
    "runtime_minutes": 103,
    "director": "Lloyd Lee Choi",
    "country": "美國、加拿大",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/406?page=4",
    "category_id": "category-67",
    "title_en": "Lucky Lu",
    "synopsis_en": "A delivery driver in New York City discovers that his e-bike has been stolen. With his family en route after many years apart, Lu must contend with a community that has turned its back on him while he tries to replace the only thing promising to keep his family afloat. Inhabiting the back alleys and dangerous streets of New York City, this gripping, deeply humane film stars Chang Chen as Lu, who confronts the relentless city's indifference in a poignant story of resilience, sacrifice, and hope amidst hardship.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/406?page=4"
  },
  {
    "id": "film-410",
    "title_tc": "瑪莉瑪莉我好開心",
    "synopsis_tc": "瑪莉的世界極不尋常，老師以飛機師造型上班，校長是咖啡廠老闆，而她居住的地方，背後隨時隨地出現一座山？還有數個月就畢業的瑪莉，無論友情和愛情都出現重大變化，離奇古怪事不停發生，甚至邁向失控狀態。但終歸，少女情懷總是詩，驀然回首，茫茫人海遇上的那個他雖不能修成正果，但這世界滴滴點點全是你。納華普將一名女學生於 Twitter 寫的 410 則推文，按照原有內容及順序,轉化為虛構的鬼馬少女日誌，鮮活跳脫節奏盡顯青春活力，創作風格及幽默亦可見一斑。",
    "runtime_minutes": 127,
    "director": "納華普譚容格坦拿列",
    "country": "泰國",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/410?page=4",
    "category_id": "category-67",
    "title_en": "Mary is Happy, Mary is Happy",
    "synopsis_en": "An ordinary girl encounters the unexplainable in this bold narrative experiment from Nawapol. Mary is a high school senior due to graduate soon, and she's already busy dealing with love, friendship and general life problems. But now strange and seemingly random events are happening to her, and she must make sense of her increasingly uncontrollable life before it completely derails. Nawapol sought a new means of storytelling, and took 410 consecutive Tweets from an anonymous girl's Twitter stream as his inspiration. Keeping the order and content of the Tweets intact, he adapted them into a fictional film, resulting in an original and imaginative commentary on the unpredictable nature of contemporary life.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/410?page=4"
  },
  {
    "id": "film-450",
    "title_tc": "不忘初森",
    "synopsis_tc": "印尼熱帶叢林住着與自然共存的土著部落，他們捕獵、採集、施行巫術。隨着資本主義及現代科技進入了他們的生活，人和大自然的微妙平衡被一一打碎。挪威旅行家視叢林為未被污染的樂土,以錄像觀察部落轉變，拍下薩滿巫醫從叢林走入石屎森林的震撼。叢林不割下，如何建造繁華？歷時 15 年的拍攝，導演不斷思考自己的初衷——誰有權反對土著改善生活的渴望？但看着漫天綠意的山林變成黃土，進步的代價又是什麼？",
    "runtime_minutes": 54,
    "director": "Audun Amundsen",
    "country": "挪威",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/450?page=5",
    "category_id": "category-67",
    "title_en": "Newtopia",
    "synopsis_en": "In search of a so-called utopian world, Norwegian backpacker Andun Amundsen makes his way into the Indonesian jungle to explore a purer way of life. He meets a shaman Aman Paksa that he would form a deep friendship with. For 15 years, Amundsen lives with Aman's clan without electricity and other modern technology while documenting their lives. Can Aman resist the temptation of material comforts? The film inquires what happens when the romanticism of an exotic culture wears out and reality takes over.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/450?page=5"
  },
  {
    "id": "film-438",
    "title_tc": "殺人預言",
    "synopsis_tc": "黑道弟弟突然死亡，其同居女友文英離奇失蹤，已金盆洗手的哥哥民泰追查真相，竟發現一本暢銷小說早已預言弟弟之！弟弟所屬的幫派及警察相繼介入，所有線索如故事走向般皆指向文英，更發現文英與小說家似乎有所聯繫......多方勢力調查演變成追逐角力，民泰滿腔怒火、無懼一切，誓要找出真凶為弟弟復仇！《與神同行》影帝河正宇與《熱血司祭》金南佶再度交鋒，乾淨俐落的暴力美學，讓鮮血與悲憤一併噴發。南韓年度動作犯罪鉅獻，勇奪單日開畫票房冠軍。",
    "runtime_minutes": 99,
    "director": "金鎮煌",
    "country": "南韓",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/438?page=5",
    "category_id": "category-67",
    "title_en": "Nocturnal",
    "synopsis_en": "Starring Ha Jung-woo in a powerhouse performance, Nocturnal follows Min-tae, whose world shatters when his brother turns up dead and his sister-in-law vanishes without a trace. His investigation takes an unsettling turn when he discovers a bestselling novel by the mysterious Ho-ryung that precisely predicted his brother's death. As Min-tae delves deeper, he finds himself entangled in a web of dark secrets involving his former gang, the police, and a writer who might know more than he should. In this intense crime thriller, rage and revenge fuel a relentless chase through the shadows of night.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/438?page=5"
  },
  {
    "id": "film-408",
    "title_tc": "家嘈屋斃",
    "synopsis_tc": "患聽力障礙的姊姊某日接獲來電，得知妹妹竟離奇失蹤。她重返兩人曾同住的公寓尋找線索，卻漸漸被捲進恐懼的漩渦中。妹妹曾抱怨樓上傳來怪異噪音，如今自己也開始聽見詭異聲響，甚至收到鄰居恐嚇，指控她才是噪音的源頭。公寓流竄的怪聲似乎與妹妹失蹤有着密不可分的關聯......取材自韓國社會常見的「層間噪音」問題，由《酒鬼都市女人們》李先彬獨挑大樑，夥拍《太陽的後裔》金珉錫，以精湛演技詮釋都市人的共同惡夢，成就南韓年度最賣座驚慄片。",
    "runtime_minutes": 94,
    "director": "金秀鎮",
    "country": "南韓",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/408?page=5",
    "category_id": "category-67",
    "title_en": "Noise",
    "synopsis_en": "Are floor and ceiling noises driving you mad? A woman with hearing impairment moves into an apartment complex to look for her missing sister. She's haunted by strange sounds in her hearing aids and increasingly agitated neighbours who can't deal with all the noises from nowhere. A sleeper hit at the Korean box office, Kim Soo-jin's spine-chilling debut feature makes skin crawl with its immersive sound design and unsettling urban horrors. The intense use of sound and silence sets this apartment horror mystery apart with sensorial thrills and heightened paranoia that feeds the sinister force behind the noise.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/408?page=5"
  },
  {
    "id": "film-418",
    "title_tc": "無能之人",
    "synopsis_tc": "潦倒漫畫家助川助三時乖運舛，一次在雜誌上發現其貌不揚的石頭竟能賣出高價，把心一橫專職撿石頭，實行轉行保平安。怎知有潛質的石頭一塊都無見到，目光先被石頭大師的妻子吸引。兒子年少無知，目睹父親與人妻親近、父母關係日益緊張，仍不忘留意四周，竟真的撿到一塊奇石。這石頭能否成為扭轉失敗事業與家庭僵局的唯一希望？由柘植義春親自參與改編，著名演員竹中直人首執導筒，以冷峻的黑色幽默透射小人物如何在資本主義橫行的時代掙扎求存。是次放映 35mm 菲林版本。",
    "runtime_minutes": 108,
    "director": "竹中直人",
    "country": "日本",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/418?page=5",
    "category_id": "category-67",
    "title_en": "Nowhere Man",
    "synopsis_en": "If life hits you hard, remember it can always hit you harder. Manga artist Sukezo is beset by misfortune. However, a glimmer of hope emerges when he discovers the lucrative potential of rocks. As he navigates the tumultuous path toward a stable life, family dynamics become increasingly strained, exacerbated by Sukezo's growing attraction to the rock master's wife. One day, Sukezo's son finds a unique rock – could this be the turning point in their lives? Adapted with Yoshiharu Tsuge's involvement, actor Naoto Takenaka's directorial debut examines ordinary lives under capitalism through sharp humour. Presented on 35mm print.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/418?page=5"
  },
  {
    "id": "film-441",
    "title_tc": "加沙有個荷里活",
    "synopsis_tc": "2007年加沙，青澀大學生遇上風趣的士佬，兩兄弟自此攜手做生意——偽造醫生紙走遍城中藥房購買處方藥，再在自家鷹嘴豆餅店售賣加料彼得包。城市動盪、好景不常，腐敗警察從中作梗，想要收編線人或剷除異己。兄弟被迫分道揚鑣，小弟失意潦倒但竟獲邀試鏡，主演加沙史上第一套動作電影，更因此重遇難以忘懷的故人......當日常比虛構更荒謬，電影還能訴說什麼？土生土長的加沙雙胞胎自學電影，以黑色幽默呈現國際新聞與紀錄片以外，來自加沙的真實聲音和生活面貌。",
    "runtime_minutes": 90,
    "director": "拿薩兄弟",
    "country": "法國、巴勒斯坦、德國、葡萄牙",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/441?page=5",
    "category_id": "category-67",
    "title_en": "Once Upon a Time in Gaza",
    "synopsis_en": "From Gaza-born twin filmmakers Tarzan and Arab Nasser comes a genre-bending tale where Hollywood meets harsh reality. In 2007 Gaza, as Israel declares the territory \"hostile\" and plans its isolation, timid student Yahya and charismatic falafel shop owner Osama craft an unlikely drug scheme, hiding pills in pita bread. Their small-time hustle becomes entangled with a corrupt cop's ambitions and, unexpectedly, the making of Gaza's first action movie. Through darkly comic twists and cinematic homages, the Nasser brothers weave a layered portrait of their homeland, where everyday hustlers navigate between survival and dreams, while political tensions loom over all. This self- reflexive drama explores how stories are told in a place where reality often surpasses fiction.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/441?page=5"
  },
  {
    "id": "film-440",
    "title_tc": "承着靈魂前行",
    "synopsis_tc": "伊朗導演身處法國與巴勒斯坦攝影記者 Fatma Hassona保持日常視像通話。斷續訊號下的零碎對話長達一年，與Hassona 走上街頭捕捉的瞬間交織，拼貼出加沙不斷重演的日常：轟炸、飢餓、逃難與死亡；然而,畫面再模糊，也無法掩蓋 Hassona 的笑容與希望。康城影展宣布電影入選翌日，年僅 25 歲的 Hassona 及其家人在以軍空襲中身亡。「如果我要死，也要死得轟烈，而非成為群眾傷亡數字之一。我要留下時間和空間都無法磨滅的畫面，讓全世界都看見。」影片不只是遙遠對話的紀錄，也不只是歷史的見證，更承載故人堅韌的力量，帶領我們繼續前行。",
    "runtime_minutes": 113,
    "director": "Sepideh Farsi",
    "country": "法國、巴勒斯坦、伊朗",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/440?page=5",
    "category_id": "category-67",
    "title_en": "Put Your Soul on Your Hand and Walk",
    "synopsis_en": "Exiled Iranian director Sepideh Farsi began her film as a series of conversations with Palestinian photojournalist Fatma Hassona. Through stuttering video calls made throughout the course of a year (filmed on Farsi's phone, amplifying their distance), Hassona shares her everyday life and her dreams while giving an on-the-ground perspective of Israel's unrelenting attacks. However, when news broke that Hassona and her family were killed in an Israeli airstrike just after the film's Cannes premiere was announced, the film became a tragic and devastating memorial. More importantly, the film is an ode to the radiant and resilient spirit Hassona shows in the film.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/440?page=5"
  },
  {
    "id": "film-420",
    "title_tc": "賴皮之宿",
    "synopsis_tc": "年輕電影導演和編劇分別收到演員邀約拍戲，各自來到荒涼的海邊小鎮，豈料被對方放飛機，三人行變成尷尷尬尬二人遊。兩人漫無目的四處蹓躂，居然在海邊撿到一個胸圍，遇見遠方一名在裸奔的少女。冬日寂寥，莫名其妙遇上的三人展開屬於他們的百無聊賴浪蕩旅途。山下敦弘早期經典之作，改編柘植義春同名漫畫，完美發揮他獨有的脫力系幽默，以超現實的荒誕感呈現現實的虛無與乏味。是次放映35mm 菲林版本。",
    "runtime_minutes": 86,
    "director": "山下敦弘",
    "country": "日本",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/420?page=5",
    "category_id": "category-67",
    "title_en": "Ramblers",
    "synopsis_en": "A promising trip with actress Funaki takes an unexpected turn for two amateur filmmakers, Tsuboi and Kinoshita, who barely know each other when Funaki oversleeps. Left stranded in a desolate town, the two find themselves with nothing but time on their hands. As they wander aimlessly, they begin to forge an awkward but friendly relationship. Their day takes another unexpected turn with the sudden appearance of a young woman named Satsuko. An early work from director Nobuhiro Yamashita, this film finds the subtle humor and melancholy in a day where nothing goes to plan. Presented on 35mm print.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/420?page=5"
  },
  {
    "id": "film-395",
    "title_tc": "印象派女孩",
    "synopsis_tc": "父親癌末病重，母親獨自扛起家中經濟與照顧重擔，渴望陪伴的獨生女沉迷心靈感應,企圖讀懂大人的心。女孩看似懵懂稚嫩，有時又比誰都敏銳，懷着對成人世界的好奇與想像，在奇思異想中摸索前行，企圖尋找死亡和孤獨的解答。《75 終生計劃》導演早川千繪新作回望童年時光,將兒時筆墨難以形容的感情，化作溫暖輕柔的筆觸。童星鈴木唯宛如《搬家》漣子般靈動，又如印象派畫家雷諾阿筆下少女般明亮。夏日河畔微風與白馬共鳴，交織出一篇溫煦的少女成長物語。",
    "runtime_minutes": 118,
    "director": "早川千繪",
    "country": "日本、法國、新加坡、菲律賓、印尼、卡塔爾",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/395?page=5",
    "category_id": "category-67",
    "title_en": "Renoir",
    "synopsis_en": "Set in late 1980s Tokyo, Renoir follows 11-year-old Fuki navigating the complex landscape of pre-adolescence while her father battles terminal illness. Director Chie Hayakawa draws from personal experience to craft an intimate portrait of childhood grief, where a reproduction of Renoir's painting becomes a poignant symbol of longing and connection. As Fuki's mother struggles with work and caregiving, the young girl retreats into a world of hypnosis and dangerous experimentation, seeking answers about death and solitude. Through newcomer Yui Suzuki's remarkable performance, the film captures the delicate interplay between family bonds and isolation against Japan's economic prosperity, where material comfort fails to fill emotional voids.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/395?page=5"
  },
  {
    "id": "film-428",
    "title_tc": "流沙幻城",
    "synopsis_tc": "達卡是孟加拉的首都，兩個素未謀面的靈魂在此各自追尋出路。少數民族女子艾瑪每周騎電單車收集沙土造貓砂，卻意外在沙堆發現一隻斷指，並對它產生怪異依戀。工人哈山暗中偷取玻璃原料，夢想自立，卻如流沙幻滅。導演的短片屢獲殊榮，首部長片延續含蓄而富詩意的節奏，呈現沙的隱喻——是建築造物的基礎，本身卻是難以掌握、隨時崩塌的存在。達卡是一座沙之城，城中人猶如危脆的生命，等待被孤立，被吞噬。",
    "runtime_minutes": 99,
    "director": "Mahde Hasan",
    "country": "孟加拉",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/428?page=5",
    "category_id": "category-67",
    "title_en": "Sand City",
    "synopsis_en": "In the megacity of Dhaka, two lonely souls share the thinnest of connections via a common element: sand. Emma, an ethnic minority woman who faces racial discrimination every day, takes sand from a building site for her cat's litter box. Meanwhile, Hasan steals silica from his workplace for a glass factory that he longs to build. Influenced by Pedro Costa and David Lynch, Mahde Hasan's captivating directorial debut offers a poignant depiction of urban isolation that defies conventions at every turn. Dhaka, filtered through a permanent layer of haze, seems like an ever-present third character that looms large over the protagonists.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/428?page=5"
  },
  {
    "id": "film-405",
    "title_tc": "無盡的施嘉莉",
    "synopsis_tc": "公主施嘉莉目睹父親遭暗殺，決心踏上報仇之路卻以失敗告終，再次醒來時發現自己身處名為「死者之國」的神秘異界。傳說中，雪恥未竟並來到此地的人，亡魂會逐漸被虛無吞噬，最終連自身存在都會完全消失。為免從此灰飛煙滅，施嘉莉必須穿越死亡與絕望的邊境，展開一場無止境的復仇之旅！日本動畫大師細田守親自操刀包辦原作、編劇及導演，邀來蘆田愛菜與岡田將生聯手聲演，以哥德式美學及獨特視覺呈現華麗異世界，編寫一齣跨越生死的復仇史詩。",
    "runtime_minutes": 111,
    "director": "細田守",
    "country": "日本",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/405?page=5",
    "category_id": "category-67",
    "title_en": "Scarlet",
    "synopsis_en": "From visionary Academy Award-nominated filmmaker Mamoru Hosoda comes a powerful, time-bending animated adventur eabout Scarlet, a medieval-era, sword-fighting princess on a dangerous quest to avenge the death of her father. After failing at her mission and finding herself gravely injured in an \"Otherworld\", she encounters an idealistic young man from our present day who not only helps her to heal but shows her the possibility of a future free of bitterness and rage. When confronted again by her father's killer, Scarlet faces her most daunting battle: can she break the cycle of hatred and find meaning in life beyond revenge?",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/405?page=5"
  },
  {
    "id": "film-435",
    "title_tc": "蒙古黑夜",
    "synopsis_tc": "入獄十四年的他重投社會，只找得到靈車司機這工作。日復一日，他載着棺木駛往山上舉行葬禮；每夜，揮之不去的夢魘與痛楚令他難以入眠。他以搖滾樂與世隔絕，只有所收養的流浪狗相伴，而同行往葬禮的小僧人是僅有會傾談的人。直至遇上棺木老工匠的女兒,他的生活終於多了色彩，然而當少女捲入政治桃色事件而喪命，一切再度崩塌。是否只有暴力才能完成他的救贖？儼如蒙古版《的士司機》，在烏蘭巴托的幽暗長夜中，駛進孤獨，直面罪與罰。",
    "runtime_minutes": 138,
    "director": "Janchivdorj Sengedorj",
    "country": "蒙古",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/435?page=5",
    "category_id": "category-67",
    "title_en": "Silent City Driver",
    "synopsis_en": "After his breakout hit The Sales Girl , director Janchivdorj Sengedorj turns to a much darker story about an outcast living in the underbelly of Ulaanbaatar. Released after 14 years of relentless abuse in prison, Myagmar now lives in isolation with his stray dogs and works as a hearse driver. He finds a glimmer of hope in his bond with the similarly damaged Sarrul, but Sarrul becomes embroiled in a traumatic incident that forces him to return to his violent ways. Deliberately paced but intensely gripping, Sengedorj's Taxi Driver-inspired Mongolian noir is a bleak and disturbing vision of urban loneliness.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/435?page=5"
  },
  {
    "id": "film-388",
    "title_tc": "她和她的孟買新活",
    "synopsis_tc": "她有個演員夢，為生計而秘密從事性工作。另一個她初來乍到，以客服工作糊口，對孟買生活充滿期許。背景迥異的二人因合租而交集，在瑣碎的日常中,她們下廚晾衣、哼唱民謠，也窺看對方的脆弱與傷痕，默默生出微妙而複雜的親密情感。溫柔不批判的長鏡頭，真實捕捉女性間的情感流動與獨立堅韌的姿態，構築一首平實的現代都市女性之歌。創作靈感源自導演自身記憶，童年好友因被迫早婚而消失不見，連道別也來不及。她藉角色的遺憾與樹的隱喻紀錄這段沉重的過去，揭露傳統文化制度對女性的無形壓迫。首位摘下威尼斯影展地平線單元最佳導演獎之印度導演，為印度女性故事注入力量與肯定。",
    "runtime_minutes": 77,
    "director": "Anuparna Roy",
    "country": "印度",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/388?page=5",
    "category_id": "category-67",
    "title_en": "Songs of Forgotten Trees",
    "synopsis_en": "Two migrant women find unexpected kinship in this remarkable debut from Anuparna Roy, who became the first Indian filmmaker to win the Orizzonti Best Director at Venice. Using generous long takes, intimate observation and subtle characterisation, Roy reveals a unique friendship while crafting a universal narrative about womanhood in India and beyond. Arriving in restless urban Mumbai, remote call centre employee Swetha moves into a shared apartment with a stranger: Thooya, an aspiring actress and sex worker. The two women seem entirely different, but as the weight of shared time and space grows, their lives begin to intersect and overlap.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/388?page=5"
  },
  {
    "id": "film-442",
    "title_tc": "童是加沙淪落人",
    "synopsis_tc": "首部完全在加沙境內拍攝的劇情長片，捕捉了三十年前的珍貴風景和當地居民的殘酷日常。男孩年紀小小便要賣鳥幫補家計，與母親和姐姐住在海邊的難民營,貧窮但充滿愛。他陪街邊的盲眼老人聊天，在沙灘遇上美麗的吉卜賽女孩，聽她口中疑幻似真的故事；他聽富戶好友說他家種的橙如何離開加沙賣往歐洲，也嚮往姐姐書中地球另一邊的美國......但像他手中的小鳥一樣，他們沒有自由。在陽光炙熱的加沙海岸上，槍聲、軍人與衝突與日常交錯，暴力鎖不住孩子的天真，卻把希望扼殺在無形囚籠中。",
    "runtime_minutes": 112,
    "director": "Michel Khleifi",
    "country": "巴勒斯坦、比利時、西班牙、英國",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/442?page=6",
    "category_id": "category-67",
    "title_en": "Tale of the Three Jewels",
    "synopsis_en": "The first feature film fully shot in Gaza, this poignant tale of young love was filmed during the Israeli army's occupation. Rather than focusing on the cruelty of the occupation, Palestinian director Michel Khleifi highlights the resilience and imagination of his people, and the beauty of their homeland. Living a life marked by violence, 12-year-old Yusef often escapes the refugee camp to the countryside, where he has fallen for gypsy girl Aida. To win her heart, he must go on a quest to retrieve three jewels missing from a family necklace brought over by Aida's grandfather.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/442?page=6"
  },
  {
    "id": "film-407",
    "title_tc": "復仇廝殺夜",
    "synopsis_tc": "最新印尼恐怖片典範，賣座恐怖電影《Sijjin》編導組合延續黑暗巫術異境的全新獨立之作。血腥的詛咒蟄伏,一屋禍連兩代人。小女孩目睹雙親慘被咒殺，淪為孤兒,在繼母和另一個家庭中飽受欺凌長大。長大成人的她得知雙親慘亡的真相後，決心以其道還治其人之身——以禁忌儀式，賞善罰惡，用血祭換回屬於她的正義。縱使人鬼兩界崩潰，無人倖免，夜夜循環咒怨輪迴，融合怨念與信念的血色美學，迸發出一場復仇狂歡。",
    "runtime_minutes": 99,
    "director": "Hadrah Daeng Ratu",
    "country": "印尼",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/407?page=6",
    "category_id": "category-67",
    "title_en": "The Book of Sijjin and Illiyyin",
    "synopsis_en": "All her life, Yuli has suffered constant abuse and humiliation from her evil stepmother's extended family. When she is finally pushed over the edge, she turns to a local shaman to curse the family with horrible deaths that no ordinary person can imagine. Integrating Muslim mythology into a furious tale of trauma and vengeance – the title refers to two books that record misdeeds and sins with noble intentions – Hadrah Daeng Ratu's shocking chiller is a waking nightmare soaked with so much blood that it makes Carrie look merciful in comparison.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/407?page=6"
  },
  {
    "id": "film-437",
    "title_tc": "鰭人異變",
    "synopsis_tc": "歷盡戰火及生態災難後的兩韓終於統一，但污染卻令部分人類基因突變成為「奧米加」—— 他們長有魚鰭及河童般的長足，被政府以帶劇毒及輻射為由，列作危險物種並隔在高牆之外，如有越雷池者格殺勿論！少女在反奧教育下長，循規蹈矩成為公務員維持社會秩序，卻遇上舉止怪異的釣魚店店員，信仰及世界觀悄然崩塌。海水在紅太陽照耀下一片血紅，腥臭伴隨亡魂夜夜縈繞。朴世煐身兼編導及攝影，刻意保留雜訊瑕疵，以粗糙質感及強烈對比呈現反烏托邦視野與美學。",
    "runtime_minutes": 85,
    "director": "朴世煐",
    "country": "南韓、德國、卡塔爾",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/437?page=6",
    "category_id": "category-67",
    "title_en": "The Fin",
    "synopsis_en": "In a devastated post-war Korea, where mutated outcasts known as Omegas are exploited for labour, Mia hides her true identity while working at an eerie fishing store – a remnant of humanity's nostalgia for the lost seas. When Sujin, a newly recruited government worker, grows suspicious of Mia's unusual behaviour, her investigation into this underground world begins to crack her unwavering faith in state ideology. From visionary director Park Sye-young comes a haunting dystopian thriller that masterfully blends elements of horror and social commentary, exploring themes of identity, survival, and the dark consequences of unchecked authority.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/437?page=6"
  },
  {
    "id": "film-390",
    "title_tc": "我畢低頭",
    "synopsis_tc": "家中長子高中畢業在即,成績平平又缺乏一技之長。前途茫然之際，一份中小型工廠有薪實習出現,若正式受聘更可以免除兵役、直入大學！為幫補家計同時保障職涯前景，他答應老師推薦並踏上這條「完美出路」，在危機四伏的工廠戰戰兢兢地度過高中最後一個學期。教育與就業的界線逐漸模糊，然而社會的規則不像校規般非黑即白。導演李蘭熙延續前作《抗爭無休》對藍領的關注，細膩描繪一群被迫提前步入社會的年輕勞工，懵懂間告別學生時代，成為下一個制度中的大人。",
    "runtime_minutes": 105,
    "director": "李蘭熙",
    "country": "南韓",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/390?page=6",
    "category_id": "category-67",
    "title_en": "The Final Semester",
    "synopsis_en": "In his final semester of vocational high school, Chang-woo is seriously trying to figure out what comes next. There are very few options for someone like him: a mediocre student from a single-parent family. The reserved teen takes an internship at a manufacturing company where both opportunities and safety measures are inadequate, but sticking it out seems to be his only hope for work and college. Subtle yet searing, Lee Ran-hee's coming-of-age social drama picked up three prizes at the Busan Vision Awards for its naturalistic depiction of grinding workplace conditions and the struggles of underprivileged youth looking for a way forward.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/390?page=6"
  },
  {
    "id": "film-426",
    "title_tc": "玻璃男孩",
    "synopsis_tc": "巴基斯坦首部全手繪動畫長片，細膩畫風呈現富異國風情的蒸氣龐克世界！文森自小受嚴格的父親培養成玻璃工匠，才華出眾卻無比寂寞，直至遇上夢想成為小提琴家的女孩愛麗絲。玻璃是美麗的工藝，可惜也是戰略資源。戰爭臨近，文森父親不願協助軍隊製作武器，豈料被上校脅迫而屈服，偏偏愛麗絲正是上校的女兒。少男少女的愛情日漸滋長，但隨着戰爭白熱化,對立的立場與身份卻令使他們不得不作出選擇。導演耗費十年，歷經眾籌集資、遠赴各地求教，終為巴基斯坦動畫立下里程碑。",
    "runtime_minutes": 98,
    "director": "Usman Riaz",
    "country": "巴基斯坦、西班牙、美國",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/426?page=6",
    "category_id": "category-67",
    "title_en": "The Glassworker",
    "synopsis_en": "Pakistan's first fully hand-drawn animated feature, The Glassworker is a decade-long labour of love, reflecting both artistic devotion and a milestone achievement in the nation's cinematic history. Taking place in an idyllic fictional reality blending European and Asian cultures, the story centres on a budding romance interrupted by an approaching war. Young glassworker Vincent is a pacifist who grapples with his beliefs in the face of war, which tests his relationship with his father and strains his friendship with Alliz, the daughter of an army colonel. With its sweeping visuals, lush worldbuilding, and strong anti-war themes, Riaz's landmark animation has already earned comparisons to the work of Studio Ghibli.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/426?page=6"
  },
  {
    "id": "film-411",
    "title_tc": "老翻大師",
    "synopsis_tc": "當《瑪莉瑪莉我好開心》影碟面世後，翻版隨即見通街，這諷刺的現象勾起納華普年少睇老翻的經歷。那時曼谷恰圖恰市集藏着一間傳奇影帶舖 Van VDO，雲集世界各地的藝術電影，由王家衛到阿巴斯，大師經典到新晉作品應有盡有，唯一的共通點是全部都係老翻。Van VDO 店面細細卻總是逼滿人，在未有串流平台、戲院只放主流大片的九十年代,影迷都來這裏尋寶。它雖然非法，卻滋養着整代泰國影迷。納華普訪問多位泰國導演、學者及影評人，回顧 Van VDO 的故事，思考藝術的真正價值，拼湊出泰國文青的集體回憶。",
    "runtime_minutes": 82,
    "director": "納華普譚容格坦拿列",
    "country": "泰國",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/411?page=6",
    "category_id": "category-67",
    "title_en": "The Master",
    "synopsis_en": "In parts of the world that have no arthouse cinema or proper video distribution, piracy has been the only way for would- be filmmakers and cinephiles to see arthouse films. Nawapol's playful documentary puts the spotlight on Van VDO, a VHS shop that became the tastemaker for a whole generation of Thai cinephiles by carrying just about everything, including an eclectic selection of world cinema. In addition to proprietor Mr. Van himself, Nawapol also interviews prominent Thai filmmakers like Pen-ek Ratanaruang, Banjong Pisanthanakun and Kongdej Jaturanrasamee, all of whom became inspired to make films thanks to Van VDO.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/411?page=6"
  },
  {
    "id": "film-424",
    "title_tc": "蒙着嘴打怪魔",
    "synopsis_tc": "動畫師 Eric 的嘴巴不見了，冇口難言，只靠掛在胸前的白板與人溝通。一次按母親吩咐去探望叔叔以後，他連眼睛、耳朵等身體部位都陸續被外星人奪去，統統不見了！童年創傷化身外星巨獸時刻來襲，在同為動畫師的男友和媽媽的陪伴下，Eric 終於勇敢踏上這段奇幻的打怪獸征途。軟件工程師出身的導演利用轉描技術和 2D 手繪動畫，帶領觀眾遊走虛幻與真實之間，尋回面對陰霾和訴說的勇氣。首部代表菲律賓角逐奧斯卡最佳國際影片的動畫電影。",
    "runtime_minutes": 90,
    "director": "Carl Joseph E. Papa",
    "country": "菲律賓",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/424?page=6",
    "category_id": "category-67",
    "title_en": "The Missing",
    "synopsis_en": "From software engineer-turned-filmmaker Carl Joseph E. Papa comes this adult animated science fiction about Eric, a young man struggling with a queer crush, as well as apparently not having a mouth. Eric cannot speak and must communicate using an erasable whiteboard, yet there is a reason for Eric's condition having to do with his estranged uncle and mysterious extraterrestrials from his repressed childhood memories. Papa deftly mixes stunning rotoscoped animation with traditional 2D techniques to portray Eric's quirky and unpredictable journey, which flirts with fantasy and horror elements, yet proves universal in its themes of alienation, self-discovery and reconciliation.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/424?page=6"
  },
  {
    "id": "film-398",
    "title_tc": "總統的生日蛋糕",
    "synopsis_tc": "人人都中頭獎，唔通人人都想中頭獎？九十年代伊拉克經歷軍事及經濟制裁，獨裁者薩達姆無懼動亂，勒令全國為自己慶祝生日。九歲女孩「喜獲頭獎」成為學校代表,被迫接下為總統炮製生日蛋糕的國家級重任。然而通貨膨脹、物資匱乏,雞蛋麵粉都是奢侈品，女孩帶着寵物公雞，從沼澤向城市出發搜羅食材，完成這項國家交給她的任務！首有伊拉克電影進軍康城，編導借小女孩充滿稚氣卻堅韌的目光,展現伊拉克從未被記錄過的一面，獻給在戰亂下仍能找到愛與友誼的小孩。康城影展金攝影機最佳首作。",
    "runtime_minutes": 105,
    "director": "Hasan Hadi",
    "country": "伊拉克、美國、卡塔爾",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/398?page=6",
    "category_id": "category-67",
    "title_en": "The President's Cake",
    "synopsis_en": "In the 1990s, when people struggle daily to survive under sanctions in Saddam Hussein's Iraq, nine-year-old Lamia is \"honoured\" with an impossible task – providing a cake for her school's mandatory celebration of the dictator's birthday, in a world where even basic ingredients are precious commodities, or facing the consequences: prison or death. Alongside her spirited rooster Hindi and street-smart friend Saeed, Lamia navigates the marshes and Baghdad, encountering both cruelty and unexpected kindness. Through her unwavering determination, Hasan Hadi's Cannes Golden Camera winner shows an Iraq that has never been depicted before, dedicating itself to every kid who somehow finds love, friendship, and joy amid war and dictatorship.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/398?page=6"
  },
  {
    "id": "film-425",
    "title_tc": "在平壤中心呼喚愛",
    "synopsis_tc": "瑞典大使館祕書派駐平壤，金髮碧眼加上身份特殊，舉手投足都被嚴密監視；沒想到緣份來臨，竟邂逅當地交通指揮員墮入愛河。極權容不下跨國小情小愛，為免彼此身陷險境，平常約會如同執行秘密行動般如履薄冰。任期即將屆滿，延期申請遭拒，貼身翻譯拒絕伸以援手，而情人竟在此時突然失蹤......導演以想像突破邊境限制，描繪自己無法親身踏足的北韓，以平實不聳動的敘事和細膩的動畫筆觸，勾勒一段鐵幕下的禁戀。",
    "runtime_minutes": 73,
    "director": "Kim Bo-sol",
    "country": "南韓",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/425?page=6",
    "category_id": "category-67",
    "title_en": "The Square",
    "synopsis_en": "Director Kim Bo-sol infuses a classic story of star-crossed lovers with elements of a le Carré-esque spy thriller in this impressive directorial debut that evokes the likes of The Live of Others. Set in North Korea, the film follows Isak, a Swedish diplomat stationed in Pyongyang. Despite being under constant surveillance, Isak hides a secret love affair with traffic cop Bok-joo. When Bok-joo goes missing, Isak courageously sets out to find her. Despite its limited budget (Kim took up most creative positions himself), The Square is an exquisitely drawn and engrossing portrait of life in an authoritarian state.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/425?page=6"
  },
  {
    "id": "film-399",
    "title_tc": "若問世界誰無傷（暫名）",
    "synopsis_tc": "珠仁 17 歲的時光，是熱切投入青澀的戀愛，和好友打鬧笑談對性的好奇，替任職幼稚園校長的甩碌阿媽執手尾，閒時練跆拳道和做義工揮灑滿身活力。某日，同學發起聯署，反對出獄在即的強姦犯重回社區，只有珠仁一個不肯簽名。她衝口而出的一句話，令她周遭的世界起了劇烈變化。那邊廂，幼稚園小女孩身上的瘀青，不禁令人起疑......《我們倆》(第 13 屆)、《我們仨》(第 16 屆)導演一向擅拍兒童，早獲奉俊昊力讚為下一代大師級人馬，今次探索少女內心幽微更見精準細膩，新人徐粹彬的演出展現驚人層次和魅力。看似平凡的青春日常，幻化成對創傷、韌性和連結的動人描繪，悄無聲息地撼動心靈。",
    "runtime_minutes": 119,
    "director": "尹佳恩",
    "country": "南韓",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/399?page=6",
    "category_id": "category-67",
    "title_en": "The World of Love",
    "synopsis_en": "17-year-old Joo-in seems to have it all figured out – she's cheerful, outspoken, and lives life on her own terms. When classmates petition against a convicted rapist's return to their community, Joo-in alone refuses to sign. Her unexpected reaction triggers a seismic shift in her world, while suspicious bruises on a kindergarten girl raise alarming questions. From acclaimed director Yoon Ga-eun (The World of Us, The House of Us) comes a masterful exploration of the adolescent psyche. Newcomer Seo Su-bin delivers a layered performance in this deceptively simple tale of trauma, resilience, and human connection.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/399?page=6"
  },
  {
    "id": "film-417",
    "title_tc": "旅行的意義",
    "synopsis_tc": "兩個季節，兩段不同的邂逅。夏，初來小鎮的少年遇到同樣來自都市的女生。兩人一同參觀博物館，走到沙灘感受涼風，任由故事在空中盤旋。冬日，編劇因創作樽頸來到雪山。大雪紛飛的晚上，只剩下山頂一間民宿有空房間。民宿老闆性格乖張，孤獨一人守着破舊的木屋。邂逅就如夏日的涼風一樣出其不意，離別亦像冬日的雪花一樣無聲落地。改編自柘植義春〈海邊敘景〉和〈哄亞拉洞的弁先生〉，三宅唱再次以細膩的鏡頭捕捉每一道微小的溫暖，教人反思旅途的意義。",
    "runtime_minutes": 89,
    "director": "三宅唱",
    "country": "日本",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/417?page=6",
    "category_id": "category-67",
    "title_en": "Two Seasons, Two Strangers",
    "synopsis_en": "Encounters arrive like unexpected summer breezes, while farewells descend like winter snowflakes, silently settling on the ground. Natsuo and Nagisa meet by the sea in a small town. Together, they find comfort in simply chatting and walking. Meanwhile, Li, a scriptwriter seeking creative inspiration, journeys to the snowy mountains. She stays in a guesthouse run by a grumpy old man whose unexpected actions pull her into a bizarre local incident. Based on two stories by Tsuge, Sho Miyake's Golden Leopard winner unfolds as an elegant, intimate meditation that explores, through these parallel journeys, how casual encounters gain profound resonance.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/417?page=6"
  },
  {
    "id": "film-400",
    "title_tc": "我們意外的勇氣",
    "synopsis_tc": "演藝經紀人樂芙與年下男友廣告導演柏恩同居多年，關係表面穩定實質潛藏各種矛盾，兩人總以忙碌迴避問題。直到一場突如其來的意外，讓兩人不得不重新檢視彼此在愛情與生活中的位置:年齡差距、家庭背景、人生規劃，如同一道道無形的牆，考驗他們是否仍能鼓起勇氣，攜手走向未來。知名 MV 導演游紹翔改編自身經歷，首度執導劇情長片，由《大佛普拉斯》《消失的情人節》資深影人葉如芬與五月天主唱阿信共同監製，劉若英回歸大銀幕，夥拍《影后》薛仕凌，演活伴侶之間的脆弱與妥協。",
    "runtime_minutes": 111,
    "director": "游紹翔",
    "country": "台灣",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/400?page=6",
    "category_id": "category-67",
    "title_en": "Unexpected Courage",
    "synopsis_en": "45-year-old talent manager Love and her younger partner, commercial director Born, already share a tenuous relationship due to their age gap and pressure at work. When Love is suddenly hospitalised, they are forced to confront a newfound intimacy and an uncertain future. Ashin, frontman of rock band Mayday, serves as co-producer, while music video director Shawn Yu makes his feature directorial debut, drawing from personal experiences to craft this emotionally complex and mature relationship drama about compromises and learning to be vulnerable in love. Rene Liu and Hsueh Shih-Ling share impeccable screen chemistry as the unlikely couple.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/400?page=6"
  },
  {
    "id": "film-447",
    "title_tc": "愛的家鎖",
    "synopsis_tc": "1983年，導演的24歲姐姐出現精神分裂的症狀。從事醫學研究的父母卻無法接受這個事實，不僅拒絕為她尋求治療，更選擇將女兒長期鎖在家中，以保護為名行囚禁之實。弟弟對此深感困惑，拿起攝影機開始記錄家庭日常。導演翻找原本溫馨私密的家庭影片，忍痛翻開傷口，審視親情與疾病、倫理與抉擇之間的複雜糾纏，詰問社會對精神病的偏見以及日本傳統觀念的束縛，反問自己面對着無法重來的過去——「我們當時究竟該怎麼做?」",
    "runtime_minutes": 102,
    "director": "藤野知明",
    "country": "日本",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/447?page=7",
    "category_id": "category-67",
    "title_en": "What Should We Have Done?",
    "synopsis_en": "Director Tomoaki Fujino asks a difficult question that hits home for anyone who's struggled to help a family member with mental health issues: What should we have done? Deeply personal and powerful, this decades-spanning documentary captures the fragmented lives of his older sister, Masako, who started showing signs of schizophrenia in her 20s, and his parents who refused treatment for her. Their decision would have serious and lasting consequences as Masako's condition deteriorated. Through home videos and narration, the director recounts his family's background and dynamics, seeking to understand his sister's pain and his parents' denial.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/447?page=7"
  },
  {
    "id": "film-394",
    "title_tc": "白花與果",
    "synopsis_tc": "杏菜性格孤僻，被父母安排轉學到基督教女子寄宿學校，與明日之星莉花成為室友。肅穆莊嚴的校園裏，莉花以心為引，跳着純粹的舞蹈;杏菜目光如霜，持續批判一切虛偽表象。莉花猝然而逝，為杏菜和摯友栞留下巨大謎團。陰霾籠罩下，二人勉力理解周遭事物的意義,在成年人充滿約束與教條的世界裏小心划行。杏菜偶然發現莉花的日記，感應其靈魂仍在漫漫黑夜中翩然起舞，螢光琉璃，彷彿要引領兩個好友找到答案。新晉導演坂本悠花里漸露頭角，獲《Drive My Car》、《間諜之妻》監製山本晃久力撐。",
    "runtime_minutes": 111,
    "director": "坂本悠花里",
    "country": "日本",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/394?page=7",
    "category_id": "category-67",
    "title_en": "White Flowers and Fruits",
    "synopsis_en": "Attending an all-girls Christian boarding school, Anna is ostracised by other students because she claims to see ghosts, while her roommate, Rika, is a popular honour student loved by all. When Rika commits suicide, Anna begins to feel Rika's spirit entering her body. Through Rika's diary, Anna and Rika's traumatised best friend Shiori try to piece together what happened. Yukari Sakamoto's debut feature is a fascinating hybrid film that blends supernatural fantasy with schoolyard drama. Showing how grief can manifest in unexpected ways, it's a meditative and bewitching tale that also touches on female agency and religious hypocrisy.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/394?page=7"
  },
  {
    "id": "film-443",
    "title_tc": "回憶中的加沙",
    "synopsis_tc": "三卷被遺忘的 DV 錄影帶，記錄了已不復再的加沙。2001年，導演前往加沙尋找十多年前待過同一所監獄的囚友，尋人不成,卻不經意留下與當地導遊及其親友的日常片段：玩啤牌、看籃球比賽；遙望蔚藍海岸、走過頹垣敗瓦、聽着夜晚街上傳來槍聲。加沙居民身處夾縫困境，但生活仍需繼續。拍攝數年後哈馬斯執政，以色列海陸空封鎖加沙地帶，不再容許進出，使這些平凡紀錄更彌足珍貴。導演在多年後重新剪輯這些片段，回溯曾經遇上的人和事，反看今天巴勒斯坦人民的遭遇，更添唏噓。",
    "runtime_minutes": 106,
    "director": "Kamal Aljafari",
    "country": "德國、巴勒斯坦、法國、卡塔爾",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/443?page=7",
    "category_id": "category-67",
    "title_en": "With Hasan in Gaza",
    "synopsis_en": "Edited from three MiniDV tapes recorded in November 2001 during the second Palestinian uprising against Israeli occupation, Kamal Aljafari's memory piece traces the director's search for a man he knew in prison. Without much in the way of narrative, the tapes show everyday people living ordinary lives in Palestine even as protests and gunfire ring out in the horizon. Already a powerful reflection on his unfair imprisonment and a heartfelt tribute to his people, Aljafari's travelogue takes on even more poignant meaning when one realises that the current war has likely decimated most locations in the footage.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/443?page=7"
  }
]