[
  {
    "id": "film-376",
    "title_tc": "世外",
    "synopsis_tc": "人死後，輪迴之前，亡魂會來到「世外」，由靈守帶領投胎轉世。直至一天，靈守小鬼遇上了被執念詛咒的小妹，若小妹完全被忿恨支配，不論世外還是人間都會與她一同灰飛煙滅！為阻止悲劇發生，小鬼不惜踏上了橫跨千年的宏大征途，為的只是一個承諾⋯⋯睽違 22 年再有港產動畫揚威海外，新生代動畫導演吳啓忠、監製兼編劇楊寶文聯同本地製作團隊，耗時七年將得獎短片重新製作，糅合佛教哲學與東方美學，在充滿憤怒及絕望的世界中，引領我們面對仇恨與遺憾，嘗試放下並繼續前行。",
    "runtime_minutes": 111,
    "director": "吳啓忠",
    "country": "香港",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/376",
    "category_id": "category-67",
    "title_en": "Another World",
    "synopsis_en": "In this visually stunning animated fantasy, death is just the beginning. Between life and rebirth lies \"Another World\", where the spirit guide Gudo shepherds lost souls to their reincarnation. When he encounters Yuri, a young girl whose uncontrollable rage threatens both the physical and spiritual realms, Gudo faces his greatest challenge yet. Tasked by Goddess Mira to prevent Yuri’s curse from destroying the world, Gudo embarks on a perilous mission – a thousand-year journey. Marking a triumphant return of Hong Kong animation to the global stage, Ng’s adaptation of the Japanese novel Sennenki is a mesmerising exploration of grief, anger, and redemption.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/376"
  },
  {
    "id": "film-377",
    "title_tc": "神秘場",
    "synopsis_tc": "港產片世界首映﹗",
    "runtime_minutes": 90,
    "director": "",
    "country": "",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/377",
    "category_id": "category-67",
    "title_en": "Surprise Screening",
    "synopsis_en": "World Premiere of a Hong Kong Film!",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/377"
  },
  {
    "id": "film-378",
    "title_tc": "逆轉上半場",
    "synopsis_tc": "人生勝利組希文靠自己努力，打敗 99.9% 香港人，卻因誤信朋友面臨破產邊緣。由深水灣搬到深水埗，勢要在短時間內極速債務重組，一日未認輸一日都未輸！得知天真富二代正籌組足球聯賽，剛好同房表妹閒時會在街場與幾個小嘍囉踢波追夢，有乜比基層追夢更追夢。當然一波會有三折，到底希文與五個小孩又會如何踢出精彩的一局呢？典型格局非典型救贖，久違的温情港產喜劇，笑聲笑聲滿載温馨，注入我體內，大小演員個個賣力演出，演活擅打逆境波的港人故事。",
    "runtime_minutes": 104,
    "director": "黃柏基",
    "country": "香港",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/378",
    "category_id": "category-67",
    "title_en": "Pass and Goal",
    "synopsis_en": "Once a high-flying financial advisor, Hay Man loses everything and moves from her Deep Water Bay mansion to her cousin's modest home in \"Deep Water Bo\". Hoping to restore her fortune, she agrees to coach a scrappy U12 football team led by her cousin Ying and neighbourhood children for a league organised by a clueless rich heir. What begins as reluctant duty soon transforms into true mentorship, as Hay Man helps the kids confront struggles and regains her own sense of purpose. When the underdog team reaches the finals, she must choose between luxury past and newfound identity.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/378"
  },
  {
    "id": "film-379",
    "title_tc": "殺手#4",
    "synopsis_tc": "車仔麵舖主打代客斬料，原來暗藏殺機？亞洲神秘殺手組織以麵店為幌子，隱藏鬧市之中為殺手接單及交換情報。4 號自幼失去雙親,在麵店長大並成為職業殺手，一次獲派到日本公幹暗殺黑幫頭目，竟然失手被當地少女埋伏！原來對方正是本次任務委託人，為求復仇不惜傾家蕩產，試圖拉攏 4 號幫忙完成報仇大計，卻令兩人雙雙被黑幫追殺⋯⋯新晉導演梁居英自編自導，當紅男星魏浚笙首度擔綱出演男主角，聯同日本新星南沙良、巨星竹中直人，以及朱栢謙和韋羅莎等人從香港打到日本，順勢打入美國奇幻電影節競賽。",
    "runtime_minutes": 108,
    "director": "梁居英",
    "country": "香港、日本",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/379",
    "category_id": "category-67",
    "title_en": "Road to Vendetta",
    "synopsis_en": "Hidden in a bustling city, a noodle shop serves as a hub for a mysterious assassin organisation. No.4, orphaned and raised in the shop, accepts a seemingly straightforward mission in Japan, where he falls into a trap set by his mysterious client. As she attempts to recruit him for her vendetta, their actions lead to both being hunted by the yakuza. Starring rising star Jeffrey Ngai in his first leading role, alongside Japanese newcomer Sara Minami and veteran Naoto Takenaka, with Chu Pak Him and Rosa Maria Velasco, this Hong Kong-Japan coproduction delivers a composed and enthralling calling card from a cast who together make an unstoppable team.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/379"
  },
  {
    "id": "film-380",
    "title_tc": "電競女孩",
    "synopsis_tc": "「我們接下來可以做什麼？」職業電競隊隊長因多支隊伍被解散，決意轉換跑道成為職場新人，看似重踏「正軌」其實過得同條鹹魚冇分別，自閉打機時機緣巧合認識了隱世世一，重燃電競初心。嘗試不靠後台，瞞住老豆男友自組隊伍參加業餘比賽。更在茶餐廳自組民間比賽聲名大噪，卻招來財團惡意打壓，面對再次的 Cancel、解散，夢想如戰場，這班在虛擬世界的戰友又如何在現實生活中打敗巨人？首部劇情電影計劃大專組作品，楊帆與白瑋琪戲裏戲外一齊用愛發電，合導交出一齣青春熱血電競物語，一時輸贏並不那麼重要，唯有並肩作戰才能繼續開發新的秩序。",
    "runtime_minutes": 110,
    "director": "白瑋琪、楊帆",
    "country": "香港",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/380",
    "category_id": "category-67",
    "title_en": "Gamer Girls",
    "synopsis_en": "When her professional esports team disbands, former captain Summer ventures into the corporate world after graduation. Unable to shake her passion for competitive gaming, she forms \"Gamer Girls\", an amateur all-female team that transforms local Cha Chaan Teng into gaming venues. Just as they gain popularity, gaming companies shut down their events citing copyright violations. With Hong Kong esports team selections looming, these determined players must fight to restore their competition rights. Co-directors Veronica Bassetto and Sophie Yang deliver an energetic youth esports tale, where winning or losing matters less than fighting side by side to forge an ideal world.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/380"
  },
  {
    "id": "film-381",
    "title_tc": "像我這樣的愛情",
    "synopsis_tc": "我們這樣，是愛嗎？阿妹天生患有腦性麻痺，性格卻異常跳脫樂觀，閒時會約朋友踩板吹水，畫畫作樂，二十多年來一直努力不被身體耽誤。可是過度保護的母親堅決安排她進行子宮切除手術，阿妹努力建立的生活再次失去平衡，她的身體永遠是不由自主的。在朋友推薦下，阿妹找到了一個專為殘疾人士提供性服務的自發組織，並認識了義工 Ken。這無私的相遇彷彿撫慰了兩個受傷的靈魂，那日漸累積的情愫沖淡了道德與身體的羈絆，這樣的關係，是愛嗎？譚惠貞繼《以青春的名義》(第 14 屆開幕電影)後第二部長片作品，將愛情元素和身障者性權益議題融合，成就一個道德探索與自我尋找的故事。",
    "runtime_minutes": 105,
    "director": "譚惠貞",
    "country": "香港",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/381",
    "category_id": "category-67",
    "title_en": "Someone Like Me",
    "synopsis_en": "Mui, a vibrant young lady with cerebral palsy, has always navigated life optimistically despite its challenges. However, her carefully constructed world is threatened when her overprotective mother insists on a hysterectomy, causing Mui to fear the loss of her identity as a woman. Seeking solace and autonomy, she discovers a unique volunteer group providing sexual services for disabled individuals. There, she meets Ken, an enigmatic volunteer grappling with his own hidden wounds. Their connection deepens, blossoming into an affectionate yet elusive bond that challenges societal norms and physical limitations. Like Tam's In Your Dreams (14th HKAFF Opening Film), Someone Like Me is a provocative exploration of desire, identity, and the courage to claim one's own narrative.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/381"
  },
  {
    "id": "film-382",
    "title_tc": "今天應該很高興",
    "synopsis_tc": "在加拿大安大略省一個日漸沒落的華人社區，四名九十年代移居而至的港人，看似平淡的移民生活正悄然崩塌。過氣香港樂壇新星、中年照顧者女兒、艱辛求存的單親母親、喪偶多年自詡模範移民的中佬，同譜一幅有關離散與脆弱連結的心靈群像。四個脆弱靈魂渴望相連，但原來寂寞可以無邊蔓延。導演成長於加國移民社區，影像聚焦九十年代移民的掙扎與孤獨，回不去也難融入。借鏡前人經歷，面對當代的移民潮，或許這也是你和我的自我拷問——我們每個人,何以為家?",
    "runtime_minutes": 110,
    "director": "楊永光",
    "country": "香港、加拿大",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/382",
    "category_id": "category-67",
    "title_en": "Finch & Midland",
    "synopsis_en": "In the often overlooked, aging neighbourhoods of Scarborough, Ontario, four Hong Kong immigrants who arrived in the 1990s quietly unravel in middle age. Once a rising star in Hong Kong, a devoted carer for her elderly mother, a single mother struggling to make ends meet, and a widower yearning for connection – they each clutch fading fragments of dignity, community, and hope in a place as worn and forgotten as they are. The film portrays these fragile souls reaching out for connection – and discovering how far loneliness can stretch. Growing up within this immigrant community, the director witnessed firsthand the resilience of immigrants, creating a poignant meditation on displacement, aging, and the delicate threads that bind us all.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/382"
  },
  {
    "id": "film-383",
    "title_tc": "國寶",
    "synopsis_tc": "立花喜久雄生於黑道之家，在衝突中喪父後，因獨有天分而獲歌舞伎名門花井半二郎破格收入門下，與花井家繼承人俊介亦敵亦友，互相砥礪，將青春奉獻給舞台。喜久雄為衝破偏見躋身頂流，甘願與魔鬼交易；俊介身為名門之後，純正血脈是祝福還是詛咒？血統與才能、榮耀與孤寂、信任與背叛，交織出一襲以藝術為名的華美之袍,上面卻爬滿蝨子。在劇變時代中、無形枷鎖下，要花多少代價，方可成就舉世無雙的「國寶」？李相日第三度將吉田修一著作搬上大銀幕，獲譽為「震撼靈魂的狂熱」，日本狂收 140 億，躍升日本真人電影史上票房第二位，代表日本角逐奧斯卡。",
    "runtime_minutes": 174,
    "director": "李相日",
    "country": "日本",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/383",
    "category_id": "category-67",
    "title_en": "Kokuho",
    "synopsis_en": "Set against the sumptuous world of Kabuki, Japan's stylised male theatrical tradition, Kokuho opens in Nagasaki in 1964 and unfolds the intertwined destinies of two devoted performers. After the death of his yakuza father, gifted teenager Kikuo catches the eye of renowned Kabuki master Hanjiro Hanai, who breaks tradition to accept him as a disciple. Alongside Hanai's only son and heir Shunsuke, Kikuo embarks on a five-decade journey where artistic pursuits mirror the intense drama of their personal lives, filled with triumph, desire, and devastating loss. Lee Sang-il's adaptation of Shuichi Yoshida's bestseller became Japan's second-highest-grossing live-action film with over 14 billion yen at the box office, acclaimed as a \"once-in-a-century masterpiece\".",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/383"
  },
  {
    "id": "film-409",
    "title_tc": "愛情悄悄來了",
    "synopsis_tc": "36個鏡頭，記下幕幕已成追憶的感情段落。她慣用數碼相機，他偏愛菲林質感；她為電影勘景，他作美術布置。電腦突然報銷，女生失去了所有和他的照片，在忘了與忘不了之間，她只能努力地尋找失落的影像，試圖重回和他共度的時光。納華普先以短片導演及編劇身分活躍於泰國獨立影壇，首部長片以36 個定格鏡頭進行視覺實驗，構圖簡約獨特，含蓄凝視之中埋藏情感暗湧，影像富有詩意地呈現記憶之虛無與人生感情散聚無常。",
    "runtime_minutes": 68,
    "director": "納華普譚容格坦拿列",
    "country": "泰國",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/409",
    "category_id": "category-67",
    "title_en": "36",
    "synopsis_en": "A poetic experiment with 36 static shots, mirroring analog film frames, crafts a meditation on memory and loss. When location scout Sai's hard drive crashes, erasing a year's photos including traces of a potential romance, she embarks on a quest to recover her digital memories. Between forgetting and remembering lies a constant yearning for memory fragments and an ambiguous longing for love. Nawapol first built his presence in the Thai independent film scene through short films and screenwriting. His first feature gained him wider recognition as a notable directorial voice.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/409"
  },
  {
    "id": "film-397",
    "title_tc": "好孩子",
    "synopsis_tc": "變裝皇后家好與家人疏離，因媽媽罹患失智症需貼身照顧，才久違回了家。母親記憶力衰退，不斷提起家好童年軼事，耿耿於懷。有次家好忘記卸妝被母親撞見,為安撫她，只好謊稱自己是母親失散多年的女兒，怎料母親信以為真，令家好展開一段療癒原生家庭創傷之旅。到底家好是否可以月圓？王國燊繼《男兒王》又一變裝皇后力作，聯同新加坡視帝許瑞祺和《花路阿朱媽》(第 19 屆)洪慧芳，將新加坡變裝皇后 Sammi Zhen 真實故事搬上大銀幕。",
    "runtime_minutes": 105,
    "director": "王國燊",
    "country": "新加坡",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/397",
    "category_id": "category-67",
    "title_en": "A Good Child",
    "synopsis_en": "While researching his drag-themed comedy Number 1, director Ong Kuo Sin met Singaporean drag performer Christopher Lim (a.k.a. Sammi Zhen), whose real-life story became the basis for the compelling comedy-drama A Good Child. Rising star Richie Koh stars as Jia Hao, a sassy drag queen who returns home to his ailing mother Ju Hua (Golden Horse-nominated Hong Hui Fang of Ajooma) when she's diagnosed with dementia. One day, when Ju Hua is confused at seeing Jia Hao in drag, he introduces himself as Ju Hua's long-lost daughter, starting a deception that proves humorous, heartbreaking and even healing to the estranged mother and son.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/397"
  },
  {
    "id": "film-402",
    "title_tc": "良心風暴",
    "synopsis_tc": "《八月照相館》韓國名導許秦豪最新力作，一洗細膩感性作風，改編荷蘭暢銷小說《The Dinner》，黑色晚餐引爆兩兄弟尖銳矛盾。冷靜精明的律師大佬 vs 理想主義醫生細佬，一場原本優雅的晚餐猝然變調。奢華餐桌美學也難掩上流家族偽善深淵，骨肉同謀映照階級與人性悲歌。當下一代驟生變故，要守護良知還是守護孩子？薛景求、張東健兩大影帝同場鬥戲、劇力萬鈞，金喜愛展現犀利氣場，聯手將一頓晚餐演繹成一場關於親情、權力與道德的審判。",
    "runtime_minutes": 110,
    "director": "許秦豪",
    "country": "南韓",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/402",
    "category_id": "category-67",
    "title_en": "A Normal Family",
    "synopsis_en": "Successful but morally dubious defense lawyer Jae-wan and principled pediatrician Jae-gyu are brothers who pretend to get along when they meet monthly for dinner. But when they learn that their teenage kids are involved in a violent crime, brotherly civility gives way to moral clashes over how to handle the incident. Despite being best known for quiet dramas Christmas in August and One Fine Spring Day, director Hur Jin-ho gives his suspenseful adaptation of Dutch novel The Dinner the breathless momentum of a speeding train until it reaches an inevitable and tragic conclusion.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/402"
  },
  {
    "id": "film-401",
    "title_tc": "群山淡影",
    "synopsis_tc": "1982 年，英國。一位年輕有抱負的日英混血作家準備書寫其母親——1952 年，英國。戰後移英的日本婦人悅子，因長女自殺而憶起在長崎的最後一段時光。悅子與婦人幸子相遇，幸子也準備和女兒出國，對新生活翹首以待。然而，作家在拼湊線索及母親的記憶碎片時，漸漸發現母親的記憶與現實相左......石川慶改編諾貝爾文學獎得主石黑一雄早年同名原著，雙線刻劃戰後女性掙扎求存之境，表面平靜實質波瀾不休，折射出大時代下壓抑而沉重的集體記憶與痛苦。",
    "runtime_minutes": 123,
    "director": "石川慶",
    "country": "日本、英國、波蘭",
    "poster_url": "",
    "detail_url_tc": "https://www.hkaff.asia/tc/film/2025/detail/401",
    "category_id": "category-67",
    "title_en": "A Pale View of Hills",
    "synopsis_en": "Set in 1982 UK, director Kei Ishikawa's adaptation of Nobel Prize-winning author Kazuo Ishiguro's debut novel follows a young aspiring Japanese-British writer who plans to write a book based on her mother Etsuko's post-war experiences in Nagasaki. Haunted by the suicide of her older daughter, Etsuko begins to recount her memories from 1952 as a young mother-to-be. Her story starts with her encounter with Sachiko, a young woman full of hope about starting a new life abroad with her young daughter. The writer finds troubling inconsistencies as she pieces together the mementoes of her mother's Nagasaki years with the memories Etsuko shares.",
    "detail_url_en": "https://www.hkaff.asia/en/film/2025/detail/401"
  }
]